{
    "id": 1,
    "title": "About the firm",
    "paragraph1": "Wallace & Graham operates out of three buildings in the heart of downtown historic Salisbury, North Carolina, employing over 60 attorneys and legal professionals. Over the course of 40 years, lead by Partners Mona Lisa Wallace, Bill Graham, and Whitney Wallace Williams, the firm has grown to have regional and national practice and scope.",
    "paragraph2": "In 1981, North Carolina attorney Mona Lisa Wallace founded Wallace and Graham. Over the years that followed, she became nationally known for taking on cases no one else would. She represented members of working families claiming diseases, cancers, and injuries caused by some of the largest corporations in the world. Mona Lisa has a proven track record for tenacity. Hard-nosed and persistent, she has succeeded for clients when no one else thought it possible. Today, she continues to represent her clients with passion, drive, heart, and a work ethic second to none.",
    "paragraph3": "Mona Lisa has received hundreds of millions of dollars in verdicts and settlements over her 40 years of practice and numerous awards for her dedication to the law and to her clients to include: Super Lawyers designation, The Ebbie Award, Top 100 Trial Lawyers Award, Leaders in Law Award, NC Hall of Fame, American Trial Lawyer of the Year Award (2019, by Public Justice), and Tommy Malone American Eagle Award (2020, Southern Trial Lawyers’ Association). She is featured in the book, Wastelands, The True Story of Farm Country on Trial, written by Corban Addison, which tells the true story of her firm’s 8 year battle against Smithfield Foods to bring justice to nearby residents of factory farming.",
    "paragraph4": "Partner Bill Graham joined the firm in 1993, and since has been instrumental in expanding the reach and capabilities of the firm. Bill leads the firm’s asbestos department and focuses a significant part of his time to medical monitoring and cancer prevention for clients exposed to asbestos. Bill and his team have achieved significant verdicts, including the top 10 jury verdict in the U.S. in 2018 for his litigation in Finch v. BASF Catalyst, a gut-wrenching mesothelioma case. Bill has been awarded the Order of the Long Leaf Pine by the Governor of NC and serves on numerous local boards, including the Novant Health Foundation Board and Catawba College Board of Trustees, his alma mater. Bill is known for his compassion towards clients, his exceptional recall, and his love and knowledge of medicine and medical conditions.",
    "paragraph5": "In 2008, Mona Lisa’s daughter, Attorney/Partner Whitney Wallace, joined the firm. Whitney leads the firm’s workers’ compensation injury department while also litigating personal injury and complex civil litigation matters. Whitney is a natural leader and has an innate passion for fighting for justice for hard-working Americans, successfully litigating hundreds claims and numerous trials. She is beloved by her clients. In 2020, she started the firm’s charitable program, Wallace & Graham Gives, designed to engage Wallace & Graham with its community to help improve circumstances for veterans, seniors, homeless, underprivileged youth, and those harmed by drunk drivers and abuse, as well as promote improvements to the environment, health care practices, and cancer prevention. As a part of its annual plan of work, W&G Gives sponsors an “Overcoming Adversity” scholarship program providing $15,000 in scholarships to deserving high school seniors.",
    "paragraph6": "Our firm is proud to represent clients in claims both large and small. Our firm is known for defending employees who suffer from work-related injuries, diseases, and cancers and have difficulty navigating the complexities of the civil justice and workers' compensation systems. We have successfully represented thousands of workers who tragically developed chemical-related cancers and asbestos-related diseases and cancers as a result of occupational exposures. We have helped thousands injured by negligent drivers due to no fault of their own. We are proud of our work on behalf of retirees who lost pension and retirement benefits, and our work on behalf of consumers injured by unsafe products or harmed by fraudulent lending practices. We have succeeded in environmental cases to help neighbors negatively affected by companies' improper waste and toxin removal methods.",
    "paragraph7": "We continue to represent those harmed by dangerous environmental toxins and manmade chemicals; those harmed by hospital and health care conglomerates’ deceptive and illegal medical billing practices; veterans who have suffered the ill effects of water contamination at Camp Lejeune; veterans who suffer poor and unacceptable housing conditions at Camp Lejeune and Fort Bragg; and victims of senior care abuse.",
    "paragraph8": "We look forward to many more years of bringing legal justice to our deserving clients. We pledge to continue to follow our mission to make our clients our priority, and to represent each client as we would our own loved one. Helping others is what makes our job rewarding. Building relationships with our clients and fighting for them during their deepest time of need is what Wallace & Graham is all about.",
    "paragraph9": "*The results referenced on this page are not the only results the firms have achieved. Each case is different and must be evaluated on its individual merits. Prior results do not guarantee similar results can be achieved in future cases.*"
 }   