[
    {
        "id": 267,
        "image": "https://wallacegraham.com/clientuploads/directory/Team/Mona_2021.jpg",
        "name": "Mona Lisa Wallace",
        "position": "Partner",
        "email": "mwallace@wallacegraham.com",
        "extension": "mona-lisa-wallace",
        "bio": "Mona Lisa Wallace is the founding partner of the law firm of Wallace & Graham, P.A. She has successfully brought and litigated numerous significant personal injury, wrongful death, defective drug, asbestos, class action, and mass-tort claims. She has successfully litigated thousands of claims involving asbestos and other toxic exposures.  She has taken on some of the largest corporations in the world in her relentless quest for justice. Mona Lisa was born and raised in the small communities of Salisbury and Spencer, North Carolina. Growing up, she was determined to better herself and find a way to help those around her, showing early leadership skills.  In high school, she was elected as the first female Student Body President at North Rowan High School while also excelling in sports and academics.  A National Merit Scholar, she attended the University of North Carolina at Chapel Hill and received a Bachelor of Arts Degree in 1976 after three years. She attended Wake Forest University School of Law, where she received a Juris Doctor Degree in 1979. With a law degree in hand, she returned to Salisbury to practice law but had difficulty getting a job as female trial lawyers were a novelty at that time.  Her first job involved a focus on family law, representing victims of domestic abuse, which required being in court daily and learning how to argue against the most difficult and adversarial of opponents. In early 1981, a local gentleman who could not breathe sought her help, and before long, she became one of the first and most successful asbestos trial lawyers in the Southeast. In this era of the history of asbestos litigation, cases were difficult.  Before liability had been established, Mona Lisa often found herself the sole attorney for the victim, and the only female attorney, facing a courtroom full of corporate defense attorneys. She faced heavy odds, but by the 1990s, Mona Lisa had successfully represented thousands of employees who had become ill due to asbestos exposure in a wide variety of industrial settings. She had some of the largest asbestos settlements for workers reported and numerous important cases, including the Satterfield decision from the Tennessee Supreme Court.  In Satterfield, a father had worked in an Alcoa plant for many years and unbeknownst to him, his clothing carried deadly asbestos dust home to his family, which was inhaled by his infant daughter after her birth.  In deciding the case, the Court recognized a right to sue for reasonably foreseeable users of asbestos, including household members who were exposed.  Through years of litigation, by the strength of this case and others, Mona Lisa has worked to successfully force employers to provide a safer workplace and to medically monitor their employees for foreseeable diseases, thereby saving countless lives. Mona Lisa has taken a personal interest in the claims of victims of occupational cancers. Even after OSHA regulations were put in place to reduce workplace hazards, Mona Lisa still saw a steady stream of people exposed to dangerous chemicals and products in the workplace who later developed cancer. While asbestos cancers have been widely publicized, the public remains less aware of the many other kinds of toxic substances and chemicals that can cause cancer. Mona Lisa has sought to heighten public awareness on this issue and to promote early medical screening and assessment. In the early 2000s, Mona Lisa grew the law firm into other practice areas. She brought successful class actions for employees and retirees who claimed their medical and retirement benefits were being unfairly reduced.  Wallace and Graham was able to recover millions of dollars for these workers and retirees in class actions addressing their pension and medical benefits with one settlement alone in excess of $178 million.  She also took on predatory lenders, the results of which brought significant refunds to tens of thousands of low-income borrowers afflicted with “payday loans.”  When the cases started, the state was full of brick-and-mortar payday lending stores that trapped working people inside a cycle of debt. But after the cases were brought, the stores left the state.   Mona Lisa also brought several class action lawsuits against car dealers for alleged unfair and deceptive sales practices, obtaining significant settlements. She co-counseled with the U.S. Department of Justice on claims of alleged improper medical billing and warranty practices under the Federal False Claims Act.  In Tennessee, she filed a suit against a medical device company based on “whistleblower” testimony that the company had failed to honor warranties on its products, which caused the Medicare system to overpay. As a result of her efforts, in which she worked with attorneys with the Department of Justice, the device maker paid a multi-million-dollar settlement. In the last 15 years, the firm also began to take on corporations who abuse the natural environment.   Mona Lisa and her team have successfully sued many corporate wrongdoers involving such environmental toxins as coal ash, asbestos, chemicals, and most recently, hog waste.  From 2013 to 2020, Mona Lisa and her litigation team represented eastern N.C. families in one of the largest environmental claims in state history with “private nuisance” lawsuits brought against the hog production component of behemoth multinational Smithfield Foods.  Mona Lisa represented 500 neighbors against Chinese-owned Smithfield, alleging the antiquated “lagoon and spray” method of hog waste disposal was interfering with clients’ use and enjoyment of their homes and lands.  In back-to-back trials extending through 2018 and 2019, five different juries unanimously sided with the plaintiffs, awarding damages exceeding $500 million.  The surprise twists and turns of the litigation, and the seemingly insurmountable odds, will be featured by author Corban Addison in his book, Wastelands, to be released to the public on June 7, 2022. Mona Lisa’s most recent legal efforts focus on two critical issues we currently face in our State as ordinary individuals: 1) excessive and unfair medical billing practices practiced by large hospital chains operating a monopoly in certain regions of the State, and 2) improving the safety and quality of care in North Carolina’s nursing homes, particularly those owned by private equity firms and for-profit chain corporations. Regarding nursing home abuse, the firm has brought a putative class action claim regarding the alleged systematic understaffing of nursing homes, and represents one or more families in individual nursing home cases for abuse, injury or wrongful death.   In February 2022, in the State of the Union Address, President Biden and the White House highlighted nursing home negligence as an issue of national concern, identifying issues consistent with those identified by our clients. See White House Fact Sheet.  The firm has worked tirelessly to enforce nursing home residents’ ability to enforce their legal Bill of Rights to be provided with appropriate care and treatment.  In the litigation regarding medical billing overcharges, in 2021, representing Western N.C. families, Mona Lisa sued the largest hospital chain in America, HCA (Hospital Corporation of America), for alleged anticompetitive and monopolistic behavior related to HCA’s takeover of hospitals and medical care in the Asheville area and 17 Western N.C. counties.  See W&G’s lawsuit filed against HCA here.  The firm filed a second lawsuit in 2022 against Vidant Health, alleging aggressive and abusive billing collection practices. See W&G’s lawsuit filed against Vidant Health here.  North Carolina State Treasurer Dale Folwell (Republican) has filed a Statement of Interest in the HCA lawsuit because of his own concern about the rising cost of medical insurance for the state’s 750,000 current and retired public employees. Attorney General Josh Stein (Democrat) has also filed an amicus brief in support of the litigation. The awards and recognition that Mona Lisa Wallace has achieved for her legal work are voluminous.  She has been named the Public Justice American Trial Lawyer of the Year on two different occasions and was a runner-up on another (2019, 2020).  She is the first woman to receive the Tommy Malone Eagle Award bestowed by the Southern Trial Lawyers (2020).  She has consistently been acknowledged as one of the top 100 trial lawyers and among the Leaders in the Law for N.C.  She received the Achieve Award from Public Justice for her work in Consumer Litigation. She won North Carolina Advocates for Justice’s Ebbie Award and the North Carolina Gertrude S. Carraway Award of Merit. She received the North Carolina Justice Center’s Defenders of Justice Award.   Recently she was honored to be selected for the N.C. 2021 Power List of Personal Injury Attorneys, and N.C. Leaders in the Law. When asked in what manner she measures her legal achievements, Mona’s response is as follows: “You cannot judge success by the amount of money recovered, but rather, by the quality of life of those whose lives you’ve changed.”  Outside of her impassioned legal work, Mona Lisa is a philanthropist in her local community, legal community, and state. Mona Lisa is a long-time supporter of Public Justice, a national nonprofit legal advocacy organization which aims to protect consumers, employees, civil rights, and the environments.  She served as the organization’s president in 2009 and remains a member of the Board of Directors. She has been a driving force behind many initiatives of Public Justice meant to improve access to justice and ensure a level playing field for our most vulnerable citizens.  Mona Lisa was a founding member of the American Museum of Tort Law, the first law-devoted museum in America, located in Winsted, Connecticut.  The museum focuses on issues of civil justice and the protection of those who have been injured.  The museum includes historical document, exhibits and information about how the law evolved, precedent-setting cases, and results that made a difference.  It holds exhibitions on famous cases including McDonalds' scalding coffee, flammable pajamas, asbestos, breast implants, medical malpractice, Love Canal, and Ford Pintos’ exploding gas tanks. In the North Carolina State Bar, Mona has served as an advisory member of the Rules of Professional Conduct Review Committee and as a member of other committees. She has served with the Wake Forest School of Law Board of Visitors, the Catawba College Board of Trustees for decades, the Hood Theological Seminary Board of Trustees, and the New York Board of Directors of the Raoul Wallenberg Committee. Mona Lisa is a member of the North Carolina Advocates for Justice and the previous co-chair of its Products Liability Section. Mona Lisa gives generously in her hometown community of Rowan County.  Mona Lisa serves on the Board of Trustees for Catawba College.  She and her husband, Lee, donated considerably to the Rowan Salisbury School System and were instrumental in the establishment of the Wallace Educational Forum.  Mona Lisa and her husband, Lee, donated as the lead gift to establish Novant Health’s Wallace Cancer Institute, which opened in 2021, providing a state of the art cancer center in Rowan County consolidated under one roof for local residents and the region. When not working, Mona enjoys spending time with her family and friends. Mona has two daughters, Whitney Wallace Williams – an attorney and partner at Wallace & Graham – and Lane Wallace – an environmentalist and real estate investor.  Mona Lisa and her husband, Lee, have four grandchildren – two girls (Annie and Ella) and two boys (Leo and Oliver), and two son-in-laws, Brannon and Jonathan, which have completed their family. ",
        "education": "Harvard Law School, Cambridge MA; Ultimate Trial Advocacy Course – “The Art of Persuasion,” 2011 Wake Forest University School of Law, Juris Doctor with Honors, 1979 University of North Carolina at Chapel Hill, Bachelor of Arts Degree, where she was a National Merit Scholar, 1976",
        "practice": "Chemical Related Cancers or Diseases, Class Actions & Consumer Rights, Dangerous Drugs & Medical Devices, Farm Nuisances, Injuries or Diseases,  Mesothelioma & Asbestosis",
        "awards": "North Carolina Academy of Trial Lawyers - 2006 Ebbie Award, The American Trial Lawyers Association - 2007 Top 100 Trial Lawyers Award – for obtaining tens of millions of dollars in loan forgiveness and restitution to predatory loan borrowers in class action coordinated with the Florida State Attorney General., The National Trial Lawyers, Top 100 North Carolina Trial Lawyers – 2011, NCAJ (North Carolina Advocates for Justice) Award for Outstanding Service as Products Liability Section Co-Chair - 2011, Lawyers Weekly – Leaders in Law Award – 2011, North Carolina Gertrude S. Carraway Award of Merit – Restoration of Hambley- Wallace House – 2013, Historic Salisbury Foundation’s Clement Cup – commitment to historic preservation - 2018, Lawyer’s Weekly – NC Hall of Fame Member 2018, Public Justice – American Trial Lawyer of the Year Award 2018, Public Justice - American Trial Lawyer of the Year Finalist 2019, Southern Trial Lawyers’ Association – 2020 Tommy Malone American Eagle Award",
        "cases": "Duke Energy Coal Ash Settlement – ensuring clean water and enhanced property values for North Carolina coal ash communities., Outer Banks power outage litigation (E.D.N.C.) – multiple-day loss of power to Outer Banks communities over summer season -- class action settlement for $10.35 million – 2018., Inetianbor v. CashCall, No. 0:2013cv60066 (S.D. Fla.) – UDAP class action against lender – class settlement for $10 million restitution, total value with debt forgiveness exceeded $29 million – 2017., Owens and Price v. Automobile Protection Corp. and Sonic Automotive, class arbitration before the American Arbitration Association, Consolidated Case No. 30 459 00642 05, and in state and federal court -- unfair and deceptive finance and sales practices involving car dealer chain – class settlement and fee approved – 2012., Kucan v. Advance America, No. 04-CVS-2860 (New Hanover County Superior Court) (class action against payday lender – class settlement of $18 million – 2011., Hager v. Check into Cash, No. 04-CVS-2859 (New Hanover County Superior Court) – class settlement of $12 million – 2011., McQuillan v. Check n Go, No. 04-CVS-2858 (New Hanover County Superior Court) – class settlement of $14 million – 2011., Murdock v. Rebate Cash Advance, No. 06-CVS-1865 (Iredell County Superior Court) and AAA class arbitration – UDAP class action/arbitration against payday lender – class settlement of $11 million – 2011., George v. Duke Energy Retirement Cash Balance Plan, No. 8:06-CV-373 (D.S.C.) -- class action under ERISA in regard to pension plan – class action settlement for $30 million – 2011., Lowther v. AK Steel, No. 1:11 cv 877 (S.D. Ohio) -- class action arising under ERISA in regard to employee welfare benefits – class settlement of $16 million – 2011., Merkner v. AK Steel, No. 1:09-CV-423-TSB (S.D. Ohio) -- class action arising under ERISA in regard to employee welfare benefits – class settlement of $170 million – 2010., Mills v. Hendrick Automotive, No. 04 CVS 2301 (Union County Superior Court) -- UDAP class action against car dealer chain – class settlement of $5 million – 2010., Satterfield v. Breeding Insulation Co., 266 S.W.3d 347 (Tenn. 2008) – notable state supreme court decision recognizing duty to household members in civil asbestos injury setting., Anthony v. Koch Industries, No. 1:05CV00806 (M.D.N.C.) -- class action under ERISA in regard to a retiree benefit plan – class settlement for $15.9 million – 2007., McKiver, et al. v. Murphy-Brown, LLC trial before the U.S. District Court, Eastern District of NC, Case No. 7:14-cv-00180 – 10 plaintiffs – total verdict: $50,750,000, McGowan, et al. v. Murphy-Brown, LLC trial before the U.S. District Court, Eastern District of NC, Case No. 7:14-cv-00182 – 2 plaintiffs – total verdict: $25,130,000, Artis, et al. v. Murphy-Brown, LLC trial before the U.S. District Court, Eastern District of NC, Case No. 7:14-cv-00237 – 6 plaintiffs – total verdict: $473,500,000, Gillis, et al. v. Murphy-Brown, LLC trial before the U.S. District Court, Eastern District of NC, Case No. 7:14-cv-00185 – 8 plaintiffs – total verdict: $102,400, McGowan, et al. v. Murphy-Brown, LLC (part 2) trial before the U.S. District Court, Eastern District of NC, Case No. 7:14-cv-00182 – 10 plaintiffs – total verdict: $420,000, Numerous verdicts, appellate court decisions and settlements for matters involving catastrophic personal injury, wrongful death, occupational injuries, industrial exposures and asbestos related illness., Wallace and Graham is responsible for advocating for many of the North Carolina appellate results and holdings of note supporting the rights of workers and those who are victims of occupational injury and illness.",
        "affiliations": "Licensed in and Member of North Carolina State Bar since 1979, Licensed in and Member of South Carolina State Bar since 1999, Licensed in and Member of Pennsylvania State Bar since 2009, Licensed in and Member of Texas State Bar since 2000, United States District Court, Western District since 1998, United States District Court, Eastern District since 1998, United States District Court, Middle District since 1979, State Superior and District Courts, North Carolina since 1979, United States District Court, South Carolina since 1999, United States Supreme Court since 1998, Supreme Court of North Carolina since 1979, Supreme Court of South Carolina since 1999, Supreme Court of Texas since 2000, United States Court of Appeals, Fourth Circuit since 1991, North Carolina Bar Association since 1979, North Carolina Advocates for Justice (NCAJ) since 1979 (Formerly known as: North Carolina Academy of Trial Lawyers), American Bar Association, Patron since 2003, Public Justice since 1995, (Formerly known as: Trial Lawyers for Public Justice), American Association for Justice (AAJ) since 1985, Southern Trial Lawyers Association (STLA) since 2010",
        "appointments": "North Carolina State Bar, Former Advisory Member, Rules of Professional Conduct Review Committee, Former Member, Public Service and Information Committee Former Member, Family Law Committee Wake Forest School of Law, Board of Visitors, Catawba College, Board of Trustees, Public Justice President (2010-2011) Executive Committee, Board of Directors Diversity Committee, Co-Chairman, Program Development Committee Case Development Committee, Co-Chairman, Major Donor/Special Gifts Committee North Carolina State Coordinator, North Carolina Advocates for Justice – NCAJ Board of Governors, Section Chair of the Products Liability Section Membership Committee, Co-Chairman, Product Liability Section PAC committee member, Former Executive Committee, Workers’ Compensation Legislative Committee, Former PAC (Political Action Committee) Trustee, Association of Trial Lawyers of America Law Schools Committee, American Bar Association, ABA Task Force on Asbestos within the Tort Trial and Insurance Practice Section, Raoul Wallenberg Committee of the US, Board of Directors Workplace Injury Litigation Group, 2005-2006 Board of Directors Workers Injury Law & Advocacy Group 2005-2006 Board of Directors, 2010 – NCAJ – guest speaker at annual meeting held in Canada, Publications, Proving & Defending Damage Claims; A Fifty State Guide; Co-Author of Chapter 7, State Consumer Protection Statutory Remedies, Compensation Under A Trust-Fund Solution To Asbestos Claims: Is It Really Fair?, Co-Author",
        "civic": "Trustee, Catawba College, Chairman, Catawba College Board of Visitors, Advisory Board, Wake Forest School of Law, Former Member, Board of Trustees, Hood Theological Seminary, Livingstone College, Former Chair, Ralph Ketner School of Business Advisory Council, Catawba College, Co-Chair, Catawba School of Business, Former Member, United Way Board of Directors, Former Member, Tri-County Mental Health Board of Directors First Presbyterian Church, Rowan Helping Ministries, Former Board Member, Executive Committee Member, Benefactor and chief contributor – Wallace Educational Forum – providing public educational resources and building for local community., Numerous other significant acts of charitable contributions, community and educational support",
        "charity": "Mona Lisa and Lee Wallace Charitable Foundation, Wallace Educational Forum, Wallace Cancer Center, Mona Wallace Public Interest Support Fund – Wake Forest University, Benefactor for the American Museum of Tort Law, Catawba College Scholarship Program"
        },
        {
        "id": 336,
        "image": "https://wallacegraham.com/clientuploads/directory/Team/Bill_2021.jpg",
        "name": "Bill Graham",
        "position": "Partner",
        "email": "bgraham@wallacegraham.com",
        "extension": "bill-graham",
        "bio": "Bill Graham is a partner with the law firm of Wallace & Graham.  Mr. Graham is a former prosecutor and is a strong supporter of law enforcement in North Carolina.  Mr. Graham is also a strong supporter of legal protection for United States military service members and their families in North Carolina. Mr. Graham has served on the North Carolina Rules Review Commission, is a member of the North Carolina Bar Association and formerly served as Secretary of the Cabarrus County Board of Elections. Mr. Graham is also a founding member of the Board of Directors of Community Bank of Rowan.  Mr. Graham is a successful businessman outside of his law practice. His latest business venture is developing an insurance product for people in the event that they lose their jobs. Mr. Graham is active in the Republican Party.  A committed conservative, he has been a strong supporter of The Jesse Helms Center, where he currently serves as Secretary of the Board of Directors, and is an active member in the American Conservative Union.  Bill served on the U.S. Agriculture Committee for Senator Jesse Helms. Mr. Graham recently spearheaded one of the largest grassroots movements in North Carolina history, which brought 75,000 North Carolinians forward to sign a petition and 1,000 people to a downtown rally in Raleigh. The Raleigh News & Observer recently wrote that Graham’s “crusade against the state gas tax has hit a nerve across North Carolina.” Governor Easley was forced to cap the gas tax and as a result North Carolina taxpayers saved $159 million in 2007. Over the course of his outstanding career, Mr. Graham has become acknowledged as a dedicated North Carolina wrongful death attorney and personal injury litigator. He has extensive experience litigating Navy veteran mesothelioma cases. Highly knowledgeable in various aspects of personal injury law, Mr. Graham offers effective representation for North Carolina work injury victims, toxic exposure and chemical exposure sufferers.  A native of Harnett County, Mr. Graham currently serves on the Catawba College Board of Trustees.",
        "education": "Earned a law degree from Antioch University, finishing at Wake Forest University.Bachelor of Arts from Catawba College",
        "practice": "Chemical Related Cancers or Diseases, Mesothelioma & Asbestosis",
        "awards": "Catawba College’s Adrian L. Shuford Jr. Award for Distinguished Service, 2014",
        "cases": "",
        "affiliations": "",
        "appointments": "",
        "civic": "",
        "charity": ""
        },
        {
        "id": 344,
        "image": "https://wallacegraham.com/clientuploads/directory/Team/www.jpg",
        "name": "Whitney Wallace Williams",
        "position": "Partner",
        "email": "wwallace@wallacegraham.com",
        "extension": "whitney-wallace-williams",
        "bio": "Whitney Wallace Williams was born and raised in Salisbury, North Carolina. After graduating high school from Salem Academy in Winston-Salem, Whitney attended the University of North Carolina at Chapel Hill and thereafter attended Wake Forest University School of Law, graduating in 2008 with a Juris Doctorate degree. During law school summers, Whitney clerked with the North Carolina Court of Appeals and New York City law firm, Lieff Cabraser. After graduation, Whitney returned to her hometown of Salisbury to practice law alongside her mother, Mona Lisa Wallace, and other talented colleagues at Wallace & Graham, seeking to make a difference in the lives of others through the legal system. From her very first memory, Whitney has had an innate passion to help people, particularly those bullied or underprivileged. Whitney’s passion for the law and justice was largely shaped by observing her mother advocate for clients in their deepest times of need during the entirety of her formative years. Her humor, groundedness, positive disposition, and efforts towards work/life balance are a credit to her exceptional father, Lee Wallace, a third generation real estate developer and owner of Wallace Realty. Since 2008, Whitney has practiced civil litigation and workers’ compensation, helping hundreds of clients achieve justice and peace of mind through the legal system. She has tried numerous cases before the North Carolina Industrial Commission, including wins on behalf of her client in the North Carolina Court of Appeals and Supreme Court. In 2019 and 2020, she was nominated alongside her litigation team, with the Trial Lawyer of the Year award by national nonprofit organization, Public Justice - winning the award in 2020, for the firm’s work on its environmental litigation case against Smithfield Foods. In 2020, she was invited by the North Carolina Industrial Commission to lecture at the Twenty-Sixth Annual North Carolina Workers’ Compensation Educational Conference. Whitney is a member of the North Carolina State Bar, Rowan County Bar, Rowan County Bar Association (Past-President), American Association for Justice (AAJ), North Carolina Advocates for Justice (NCAJ), and the Public Justice Foundation (PJ). Outside of work, Whitney is deeply engaged with her community and nonprofit boards and is dedicated to making her small community of Salisbury and Rowan County the best that it can be. Since 2011, she has consistently served on boards, committees, and commissions, pursuing one passion project after another to improve the lives of local citizens. In 2021, Whitney was honored for her community leadership in the by the Salisbury Post in its piece, Spirit of Rowan. In 2022, Whitney was awarded the North Carolina Main Street Champion award for her advocacy on behalf of Downtown Salisbury. Whitney is proudly married to U.S. Army Veteran and business owner, Brannon Williams, and mother to two daughters, Annie and Ella Williams, who attend Salisbury Academy. The Williams family supports numerous local and statewide charities which align with their values of helping veterans, children, education, access to health care, poverty, Rowan-Salisbury arts, history, culture, and tourism, and the environment. In 2020, Williams created, launched, and continues to serve as chair for Wallace & Graham’s charitable arm, Wallace & Graham Gives, a program designed to engage W&G with its community through charitable giving. The program includes a committee comprised of W&G attorneys and legal professionals and donates $50,000.00 annually to the Rowan-County community, affecting change in the areas of veterans’ access to mental health treatment, education, senior living, poverty, literacy, the environment and sustainability, cancer prevention, and health care.",
        "education": "Wake Forest University School of Law, Juris Doctor, 2008University of North Carolina at Chapel Hill, Bachelor of Arts in Sociology, 2004",
        "practice": "North Carolina Workers Compensation Lawyer, Dangerous Drugs and Medical Devices, Environmental Litigation, Personal Injury Litigation",
        "awards": "",
        "cases": "",
        "affiliations": "",
        "appointments": "",
        "civic": "",
        "charity": ""
        },
        {
        "id": 337,
        "image": "https://wallacegraham.com/clientuploads/directory/Team/Daniel_Wallace_new.jpg",
        "name": "Daniel Wallace",
        "position": "Attorney",
        "email": "dwallace@wallacegraham.com",
        "extension": "daniel-wallace",
        "bio": "Daniel concentrates his practice on workers’ compensation, personal injury, and civil litigation. He earned an undergraduate degree from North Carolina State University and a J.D. from the Charlotte School of Law. Daniel’s legal experience began in 2008 and continued through various summer clerkships while in law school. He was admitted to the North Carolina State Bar in 2013 and is a member of American Association for Justice.",
        "education": "Charlotte School of Law, Juris Doctor, 2013, North Carolina State University, Bachelor of Arts in Sociology, 2008 ",
        "practice": "Farm Nuisances, Injuries or Diseases, North Carolina Workers Compensation Lawyer, Personal Injury / Car / Motorcycle Accidents",
        "awards": "",
        "cases": "",
        "affiliations": "",
        "appointments": "",
        "civic": "",
        "charity": ""
        },
        {
        "id": 338,
        "image": "https://wallacegraham.com/clientuploads/directory/Team/Ed_Pauley_new.jpg",
        "name": "Ed Pauley",
        "position": "Attorney",
        "email": "epauley@wallacegraham.com",
        "extension": "ed-pauley",
        "bio": "Ed joined Wallace & Graham in 1999. He handles workers’ compensation, asbestos litigation, personal injury and civil litigation. Ed has handled hundreds of cases before the North Carolina Industrial Commission and appears frequently in appeals before the Full Commission of the NCIC and the North Carolina Court of Appeals. Admitted to practice in North Carolina, Kentucky, and West Virginia and before the United States Supreme Court, Ed is a member of the American Bar Association and the North Carolina Academy of Trial Lawyers. The dedication and extensive experience of Mr. Ed Pauley have allowed him to become renowned as a highly effective work-related injury lawyer and a talented defective medical devices attorney. He employs a variety of litigation, negotiation and mediation strategies to obtain the most favorable outcomes for his clients. Mr. Pauley is a leading worker’s compensation lawyer who has helped many individuals obtain just remuneration for their work-related injuries.",
        "education": "West Virginia University College of Law, Juris Doctor, 1991, West Virginia University, Bachlors of Arts in Political Science,1988",
        "practice": "Mesothelioma & Asbestosis, North Carolina Workers Compensation Lawyer, Personal Injury / Car / Motorcycle Accidents",
        "awards": "",
        "cases": "JESSE BOSTIAN VS MARTIN MARIETTA -   Worker at a quarry developed silicosis from exposure to the rock dust.  Plaintiff proved that he could no longer work in the quarry due to the dust in the work environment.  Plaintiff was awarded disability benefits by the Industrial Commission as well as payment of all past and future medical bills associated with the illness.DAVIS MAULDIN VS AC CORPORATION -  Worker was a pipefitter and welder at industrial sites around the country.  In that job, he was routinely exposed to asbestos.  In 1997, he developed laryngeal cancer and was placed on disability.  In 2007, he developed lung cancer.  At that time, it was determined that the exposure to asbestos had caused both cancers.  After a lengthy battle, the Industrial Commission finally determined that the cancers were both linked to asbestos exposure in the employment.  Mauldin was awarded disability benefits from 1997 to the present and ongoing for the rest of his life.  He was also awarded separate compensation for the lung cancer and asbestosis.  The employer was ordered to pay all past and future medical bills associated with all of his illnesses., JAMES VENERIS VS WEYERHAEUSER - Worker was a welders’ helper at a paper plant.  He suffered partial blindness from exposure to welding light.  The employer denied the claim.  The Industrial Commission found that the welding light did in fact cause the blindness and that the plaintiff was disabled as a result.  Plaintiff was awarded disability benefits including backpay and future pay for the rest of his life.  He was also awarded medical benefits for his condition for the rest of his life., JOHN HOVIS VS WESTINGHOUSE -  Worker was a welder at a plant in Charlotte.  He was exposed to asbestos and developed asbestosis.  Industrial Commission found for the plaintiff and awarded the maximum benefits for his disease., GROVER MONROE ENSLEY VS FMC-  Worker was exposed to asbestos in his employment and developed asbestosis.  The employer, a chemical plant, denied the claim.  The Industrial Commission found that the worker was entitled to benefits and found that he was totally and permanently disabled.  He received backpay and future pay for the rest of his life., GAIL BLACKBURN VS STABILUS -  Worker worked in a paint room and around chemical tanks at a plant that made auto parts.  In this job, she was exposed to a chemical hexavalent chromium.  Worker developed lung cancer and died.  Her doctor determined that the levels of chromium in her blood were four times the normal amount.  Employer denied the claim.  The Industrial Commission determined that the exposure to hexavalent chromium caused the lung cancer and ultimately her death.  ",
        "affiliations": "",
        "appointments": "",
        "civic": "",
        "charity": ""
        },
        {
        "id": 339,
        "image": "https://wallacegraham.com/clientuploads/directory/Team/John_2021.jpg",
        "name": "John Hughes",
        "position": "Attorney",
        "email": "jhughes@wallacegraham.com",
        "extension": "john-hughes",
        "bio": " John Hughes is an attorney licensed to practice law in North Carolina. He has experience representing consumers in the areas of civil litigation, insurance coverage, consumer protection, predatory lending, ERISA claims, truth in lending, fair debt collection, and complex civil litigation. Since 1995, he has been engaged in the private practice of law in North Carolina, concentrating in civil litigation. His professional affiliations, licenses and memberships include the North Carolina State Bar, American Bar Association, United States District Courts for the Eastern, Middle and Western Districts of North Carolina, and United States Court of Appeals for the Fourth Circuit. Mr. Hughes is part of the highly regarded law firm of Wallace & Graham. This law practice is home to leading North Carolina injury lawyers individuals and families consult regarding the possibility of obtaining compensation for their physical and psychological suffering. The firm’s lawyers are experts in all aspects of personal injury law. In fact, they are acknowledged as some of the more accomplished North Carolina chemical exposure, defective drugs, mesothelioma and work-related injury attorneys. Meet John Hughes, a highly skilled North Carolina class action lawyer specializing in personal injury, insurance coverage and predatory lending litigation",
        "education": "Wake Forest University School of Law, Juris Doctor Degree, cum laude, 1995, University of North Carolina at Chapel Hill, Bachelor of Arts Degree in English, 1986. ",
        "practice": "Class Actions & Consumer Rights, Farm Nuisances, Injuries or Diseases",
        "awards": "",
        "cases": "",
        "affiliations": "",
        "appointments": "",
        "civic": "",
        "charity": ""
        },
        {
        "id": 341,
        "image": "https://wallacegraham.com/clientuploads/directory/Team/Krystal_2021.jpg",
        "name": "Krystal Draughn",
        "position": "Attorney",
        "email": "kdraughn@wallacegraham.com",
        "extension": "krystal-draughn",
        "bio": "Krystal has been with Wallace and Graham for more than 15 years joining us in 2000 as a recent graduate of Catawba College where she earned a Bachelor’s Degree in Political Science.  After serving as a North Carolina Certified Paralegal for years, Krystal made the decision to go to law school.  While continuing to meet the needs of our clients, Krystal attended law school at night graduating from Charlotte School of Law in 2015 and passing the North Carolina State Bar in 2016.  Krystal continues in her role as attorney focusing on the many Asbestos Bankruptcy Trusts established to settle claims for injured workers exposed to asbestos on the job.",
        "education": "Charlotte School of Law, Juris Doctor, 2015, Catawba College, Bachelors of Arts, 2000",
        "practice": "Class Actions & Consumer Rights, Mesothelioma & Asbestosis",
        "awards": "",
        "cases": "",
        "affiliations": "",
        "appointments": "",
        "civic": "",
        "charity": ""
        },
        {
        "id": 342,
        "image": "https://wallacegraham.com/clientuploads/directory/Team/Mark_2021.jpg",
        "name": "Mark Doby",
        "position": "Attorney",
        "email": "mdoby@wallacegraham.com",
        "extension": "mark-doby",
        "bio": "After graduating from high school in Rowan County, Mark earned his Bachelor of Arts degree from the University of North Carolina at Chapel Hill in 2006 followed by his law degree from Campbell University in 2009.  He joined Wallace & Graham in September 2009 shortly after being admitted to the North Carolina State Bar. Since then, he has represented hundreds of workers who have developed a cancer or other illness related to benzene, asbestos, noise, and other toxic exposures at work.  For these individuals, he has achieved favorable outcomes at the North Carolina Industrial Commission, North Carolina state courts, as well as various federal courts. In addition, from 2013-2020, he was deeply immersed in the firm’s swine nuisance litigation against Smithfield Hog Production, where the firm represented more than 500 eastern North Carolina residents in their fight against the world’s largest hog producer.  This team tried and won five federal jury trials in Raleigh in 2018-19, amassing more than $550 million in verdicts.  Smithfield appealed the verdicts, but lost, and then finally settled with all our plaintiffs.  For his work in this litigation, Mark was among the team that was named Public Justice’s 2020 Trial Lawyer of the Year. Active in the community, Mark has served in leadership on numerous boards and committees including Past President and Vice President of the Rowan County Bar (District 19-C), Vice President of the Meals On Wheels Rowan board, and chair of numerous other committees.  He also previously served on the North Carolina Bar Association's Wills For Heroes committee, traveling all over the state to draft free estate planning documents for local first responders. He has done pro bono work, both legally and politically, for Partners In Learning, a five-star nationally-accredited childcare center in Salisbury. Most significantly, in 2021 he initiated and led the effort which secured nearly $5 million in funds from the 2021-22 state budget.  Those funds will help build Partners’ new $12 million facility slated for completion in summer 2023.  This new campus will greatly expand and improve childcare services in Rowan County for decades to come. Mark lives in Salisbury with his wife Allison, two children Cate and Myers, and dog Drew.  Whenever humanly possible, they all enjoy traveling, attending Tar Heels sporting events, or most any other outdoor activity with family or friends.",
        "education": "Campbell University School of Law, Juris Doctor, 2009, University of North Carolina at Chapel Hill, Bachelor of Arts in Economics, 2006",
        "practice": "Farm Nuisances, Injuries or Diseases, North Carolina Workers Compensation Lawyer, Chemical Related Cancers and Diseases",
        "awards": "",
        "cases": "",
        "affiliations": "",
        "appointments": "",
        "civic": "",
        "charity": ""
        },
        {
        "id": 452,
        "image": "https://wallacegraham.com/clientuploads/directory/Team/Olivia_Smith_new.jpg",
        "name": "Olivia Smith",
        "position": "Attorney",
        "email": "olivia-smith",
        "extension": "(704) 633-5244 ext. 133",
        "bio": "Olivia began working for Wallace & Graham during law school and continued her career with the firm after becoming a North Carolina-licensed attorney. She earned her Bachelor of Arts degree from Furman University, followed by her law degree from Campbell University School of Law. Olivia concentrates her practice on personal injury and civil litigation, with a special interest in nursing home litigation. Her prior experience working for the North Carolina Medical Board has equipped her with a keen understanding of the standard of care for medical providers in North Carolina.",
        "education": "Furman University, Bachelor of Arts in Accounting, minor in Spanish, 2018, Campbell University School of Law, Juris Doctor, 2021, Associate Editor, Campbell Law Observer",
        "practice": "Nursing Home Litigation - Facility Abuse & Neglect, Dangerous Drugs and Medical Devices, Healthcare Fraud, Personal Injury",
        "awards": "",
        "cases": "",
        "affiliations": "",
        "appointments": "",
        "civic": "",
        "charity": ""
        },
        {
        "id": 464,
        "image": "https://wallacegraham.com/clientuploads/directory/Team/LarryHall.jpg",
        "name": "Larry Hall",
        "position": "Attorney",
        "email": "lhall@wallacegraham.com",
        "extension": "larry-hall",
        "bio": "Following a long and dedicated career in public service, Larry D. Hall joined Wallace & Graham in 2022.  He is the former Secretary of North Carolina’s Department of Military and Veteran Affairs, serving in that role from 2017 until 2021.  Prior to that, Sec. Hall represented North Carolina’s 29th District in the House of Representatives from 2006 until 2017, serving as House minority leader beginning in 2012. Born and raised in Durham, he earned his bachelor's degree with honors in political science and business from Johnson C. Smith University and his law degree from the University of North Carolina at Chapel Hill School of Law. Upon graduation, he was commissioned as an officer in the United States Marine Corps. A decorated Marine, Sec. Hall served 16 years in the United States Marine Corps and Marine Corps Reserves, reaching the rank of Major, and served in support of the Operations in the Middle East in Lebanon and Iran. For his distinguished service, Sec. Hall was awarded the Navy Achievement Medal, the Marine Corps Reserve Medal, the Armed Forces Reserve Medal, and a Meritorious Unit Citation from the United States Marine Corps. Sec. Hall’s service to North Carolina continues to be merited, receiving the Equality in Legislation Leadership Award and Excellence from the Courtroom to the Capital Community Service Award. Sec. Hall has been featured multiple times in Governing magazine and has been honored as a Champion of NC Working Families, a 100% Environmental Champion, and a Defender of Justice for his commitment to safeguarding voting rights, expanding opportunities throughout the state for individuals and communities of low incomes, and protecting vulnerable families and members of the military from predatory lending, making him a natural fit with Wallace & Graham and its long history of pursuing justice for many of the same communities.   ",
        "education": "",
        "practice": "",
        "awards": "",
        "cases": "",
        "affiliations": "",
        "appointments": "",
        "civic": "",
        "charity": ""
        },
        {
        "id": 487,
        "image": "https://wallacegraham.com/clientuploads/directory/Team/Ben_Ridings.jpg",
        "name": "Ben Ridings",
        "position": "Attorney",
        "email": "bridings@wallacegraham.com",
        "extension": "ben-ridings",
        "bio": "Ben Ridings has been practicing workers’ compensation law for over fifteen years and is a North Carolina Board Certified Specialist in Workers’ Compensation Law.  Early in his career, he represented the interests of insurance companies and large employers.  He now dedicates his practice to helping injured workers navigate North Carolina’s complex workers’ compensation system.",
        "education": "University of North Carolina School of Law, Juris Doctor, 2007, University of North Carolina at Asheville, Bachelor of Arts in History, 2003",
        "practice": "",
        "awards": "",
        "cases": "",
        "affiliations": "",
        "appointments": "",
        "civic": "",
        "charity": ""
        }
]