[
    {
    "id": "108",
    "headline": "Lawsuit Charging Private-Equity Owned Nursing Home Harmed Residents Crawls Forward",
    "date": "Tuesday, November 15, 2022",
    "author": "Thomas Goldsmith and Rachel Crumpler",
    "source": "North Carolina Health News",
    "body": "This article is reposted from North Carolina Health News to read the original article please click this link. Residents Of The Citadel Of Salisbury, A Covid-Devastated Nursing Home, Have Charged That They Were Damaged By The Facility’s Deliberate Understaffing. Similar Cases Have Taken Years To Move Forward, Meanwhile, Those Who Claim Harm Are Aging And Dying A federal judge brought up the elephant in the room as he concluded a recent hearing in a lawsuit against a Salisbury nursing home owned by a private equity company.  “I assume the plaintiffs are elderly and infirm,” U.S. District Judge Thomas D. Schroeder said. “It would be nice to resolve this [case] sooner rather than later for the benefit of the parties.” Schroeder spoke at a Nov. 10 hearing in a Winston-Salem federal courtroom for a lawsuit filed May 17, 2021, that alleges that the Citadel of Salisbury’s owners harmed residents through understaffing.   Defendants Simcha Hyman and Naftali Zanziper, principals of the New Jersey-based private equity company Portopiccolo and owners of more than 30 North Carolina nursing homes, have denied the claims. Their company took over the Citadel in February 2020, and that’s when the severe staffing problems began, the lawsuit alleges.  The plaintiffs are Citadel of Salisbury nursing home residents Sybil Rummage, 92, described as having Parkinson’s disease, and Betty Deal, 74, bedridden and with severe arthritis, according to the suit filed by the Salisbury law firm Wallace and Graham. Given the ages of those plaintiffs, Schroeder suggested that the attorneys make some decisions soon on whether to use mediation in the case instead of heading to a June 1 trial.   'I’m inclined to stay everything for a reasonable time if folks are truly interested in resolving this,' Schroeder said. He asked that lawyers let him know by the next afternoon. But the following afternoon was a federal holiday. Court records show no filing by then and emails from NC Health News to attorneys asking about additional filings were not returned by press time.  Last week’s hearing concerned the plaintiffs’ claim that the owners of the Citadel of Salisbury should face a class-action suit because their actions affected all the nursing home’s residents as a group and they should be compensated for damages. The lawsuit alleges that Hyman, Zanziper and their related entities failed to provide the necessary levels of staff members, required medicine and supplies. The suit claims that the failures to act occurred when there were COVID-related restrictions on visits to long-term care centers. During that time, residents’ family members were not present to look out for their interests. As more private equity firms acquire skilled nursing facilities, often homes that already have a low rating by federal regulators, the North Carolina lawsuit represents just one attempt made by frail elderly residents to fight back against deep-pocketed investors. Researchers have found that facilities purchased by such investor-owned firms resulted in increased emergency-department visits, hospitalizations of residents with ambulatory care-sensitive conditions, and overall costs to Medicare. A congressional committee took a look at results of the trend in 2021. The lawsuit also is taking place against the background of a recent announcement from the Biden administration that it would take more stringent steps to prompt improvement in the problem homes called Special Focus Facilities. The Citadel of Salisbury spent almost two years as a Special Focus Facility before closing in June after federal regulators withdrew Medicare and Medicaid reimbursement.  Defendants: Mistakes were made In the suit, lawyers for the plaintiffs allege that facility owners Hyman and Zanziper deliberately understaffed the Citadel of Salisbury to enhance profits. Both defendants countered the allegations, filing a 34-page document in June. They denied that either man “acted in breach of any duty, in violation of any laws or engaged in any other alleged wrongful, reckless or wanton conduct that is improper under North Carolina law and deny that any of his conduct proximately caused injury as alleged by Plaintiffs.” The owners also claimed they have evidence that their Salisbury nursing home made mistakes that resulted in reporting fewer staffing hours than actually occurred to the federal Centers for Medicare and Medicaid Services, which regulates nursing homes. The defendants, Zanziper and Hyman, have become part of a national discussion of the role of private equity in the long-term care industry. The pair have been the subject of negative media portrayals in The New Yorker, Barron’s and the Washington Post for their takeover and operation of nursing homes. Plaintiffs cited those media accounts as part of the suit as well as resident and staff interviews and state documents. 'Because of the Facility’s dire conditions, it is no surprise that the Citadel of Salisbury became the site of one of the earliest and largest COVID-19 outbreaks at any congregate care setting in North Carolina, as confirmed by testing of numerous residents which occurred on April 10, 2020,” plaintiffs’ attorneys said in the suit.  Following a March inspection, CMS effectively closed the Citadel of Salisbury by cutting off Medicare and Medicaid payments for resident care. The facility spent 21 months on the Special Focus Facility list of those receiving increased scrutiny, a who’s who of the nation’s worst-performing nursing homes. One of the state’s earliest COVID outbreaks took place there when 151 cases were documented by the state by May 2020.  Eighteen residents subsequently died from the disease. Class action status debated At the Nov. 10 hearing, attorneys for the facility owners, including Kasowitz Benson Torres of New York City, and plaintiffs’ lawyers Wallace and Graham, argued over whether the case should be heard as a class action. That meant, plaintiffs’ lawyers said, that the two aging residents, Rummage and Deal, are representative of a larger class of more than 100 residents who suffered similar harm and should also be awarded damages.  During the hearing, Schroeder posed questions on whether the case met standards for class action suits under federal law. According to the rules, the class must be assessed for factors including the number of members, their identification with the group, a legal issue common to all members and the suitability of the representatives. Another factor concerns the question of predominance, that is, whether the legal issues common to the group rise above individual cases and are best tried through a class action.  “The issue of systemic understaffing is sufficiently central and important to predominate over individual issues,” plaintiffs’ attorneys wrote. If the case proceeds to trial on the proposed June start date, instead of possible mediation in January as proposed by Schroeder, more than two years will have passed since the elderly defendants first filed the suit. There’s no predicting how long the wait will be for the original plaintiffs, both in poor health, and whether they’d live to see an outcome. Similar cases drag on Any residents and families seeking recompense almost certainly have a long road ahead. It’s not uncommon for cases such as these to drag out for years, long enough that original plaintiffs might not live to see any resolution.  A 2018 class action suit against a Craven County adult care home was certified in July in state court, a seeming victory for residents of Lake Pointe Assisted Living, who charged that the center had failed to provide adequate staffing to meet residents’ needs, serve nutritious meals, hold appropriate activities for residents, and make sure the facility complied with laws, rules and regulations for the safe operation of the facility.  However, the Craven County suit is ongoing in federal and state court. There was a victory for the plaintiffs in July when the federal Fourth Circuit Court of Appeals found that the insurance company for Lake Pointe had to defend the claims against the facility. And filings in the case continue to accumulate. North Carolina Health News is an independent, non-partisan, not-for-profit, statewide news organization dedicated to covering all things health care in North Carolina. Visit NCHN at northcarolinahealthnews.org"
    },
    {
    "id": "107",
    "headline": "NC Business Court Judge Won't Fully Dismiss Antitrust Lawsuit",
    "date": "Monday, September 19, 2022",
    "author": "Andrew Jones",
    "source": "The Asheville Citizen Times",
    "body": "This article is a repost from the Asheville Citizen Times, to view to original please click here. A North Carolina Business Court judge has partially denied HCA Healthcare and Mission Health's motion to dismiss an antitrust lawsuit brought against them just more than a year ago. Special Superior Court Judge for Complex Business Case Mark Davis is presiding over the case in which six Asheville-area plaintiffs are suing HCA, Mission and several associated entities, alleging monopoly practice that’s raising prices and lowering the quality of WNC health care. The 43-page ruling agrees that the lawsuit's original complaint found grounds that HCA has behaved in an anti-competitive manner, specifically regarding restraint of trade, 'activity that tends to limit a party's ability to enter into transactions,' according to a Cornell Law School definition. In other words, restraining trade inhibits free-market competition. In an opinion released Sept. 19, Davis partially denied HCA and Mission's motion to dismiss, meaning the case can continue in Buncombe County Superior Court. Attorneys for the plaintiffs described Davis' decision as affirming 'plaintiffs have plausibly alleged that HCA has engaged in an illegal restraint of trade that has led to consumers paying more for health care in HCA's service area.' The history of WNC's antitrust action against HCA Healthcare: HCA/Mission hit with anti-trust lawsuit, accused of exorbitant prices, declining quality HCA anti-trust lawsuit filed in Asheville gets extension, new deadlines HCA: Asheville residents' anti-trust lawsuit is an 'end-run' around Mission hospital sale AG Stein says he 'will not hesitate to act' if abuses in lawsuit against Mission are true NC Treasurer files interest in HCA anti-trust suit; plaintiffs reiterate concerns AG Stein hears WNC leaders on Mission sale fallout, says he's eyeing merger law changes Mission nurse on HCA fallout during merger hearing: Shocked and horrified HCA has seven main facilities in Western North Carolina. '(T)he Complaint’s allegations in the present case, as discussed extensively above, sufficiently identify anticompetitive practices in which Defendants have engaged during their negotiations with commercial insurers leading, among other things, to higher insurance premiums for consumers along with denial of access to information regarding price and quality as to Defendants’ facilities so as to establish their standing to advance their antitrust claims in this action,' Davis ruling stated. This lawsuit was originally filed August 2021 and became the first of three antitrust lawsuits brought against Mission in less than a year. Two others were brought by the city of Brevard and later Buncombe County and the city of Asheville. Those two cases were consolidated and Madison County is a plaintiff in that lawsuit as well, one whose language is similar to that of the Business Court case.  N.C. Attorney General, who filed an amicus brief in the case supporting the plaintiffs, said he was pleased with the judge's decision. 'Our office is pleased that the Court agreed with our position in the HCA case,' Stein's office said in an email. 'Attorney General Stein is closely reviewing the decision to determine next steps and continues to be focused on his work to ensure that North Carolinians have access to affordable, high-quality health care.' 'I believe we will prevail' 'We’re grateful that the people of Western North Carolina are one step closer to some relief from rising health care costs,' Jamie Crooks of Fairmark Partners said in a statement. “We still likely have a long road ahead but we’re committed to pursuing an outcome that holds HCA accountable for its conduct, reduces the rate of price increases, and restores competition to the hospital industry in Western North Carolina.” Fairmark and Salisbury-based Wallace and Graham represent the plaintiffs in the antitrust lawsuit. 'We are delighted that the Court has allowed the restraint of trade claim to proceed, and we look forward to continuing to seek justice for the citizens of Western North Carolina,' Mona Lisa Wallace of Wallace and Graham said in the statement.  Mission Health and HCA spokesperson Nancy Lindell said the organizations also were pleased with the decision, especially since the judge decided to approve dismissal of several claims made in the complaint. 'We appreciate the court’s thoughtful consideration of the issues raised in our filing, and we are pleased with the court’s decision to dismiss a substantial portion of the claims,' Lindell said. 'We continue to believe the allegations are wholly without merit, and we will vigorously defend ourselves through the legal process.'  Will Overfelt is one of the plaintiffs in the case and founder of the growing 13,400-member Mountain Maladies Facebook group − a hub for patient advocacy and discussion. 'It’s been a very good day,' Overfelt said in a Mountain Maladies post he gave the Citizen Times permission to use. 'Today we prevailed in HCA’s motion to dismiss and this lawsuit will indeed go forward. This lawsuit is a marathon and not a sprint. The hard work of discovery has yet to begin but this is a major hurdle. When this marathon of a lawsuit comes to close in coming years I believe we will prevail. But even if we don’t, reading these words from the judge meant a lot to me. Overfelt quoted the seminal portion of the opinion in which Davis agreed HCA and Mission were involved in anti-competitive practices. 'It means a lot to me that a judge spent a year pouring over this lawsuit and came to the conclusion that we have merit. He concludes that this isn’t frivolous,' he concluded. 'It isn’t sour grapes. There is substance and there is merit in our work.'"
    },
    {
    "id": "106",
    "headline": "Baskets By The Carload: Wallace & Graham Gifts Supplies, Money To Family Crisis Council",
    "date": "Tuesday, April 12, 2022",
    "author": "Ben Stansell",
    "source": "The Salisbury Post",
    "body": "This is a reposted article from The Salisbury Post, to read the original article please click here. SALISBURY — The baskets just kept coming. Pulling them from trunks of sedans and passenger seats of SUVs, representatives from Wallace & Graham law firm on Monday morning marched 30 'survivor' baskets brimming with toys and toiletries into Family Crisis Council’s office on 502 N. Long St. By the time every basket was unloaded and stacked together, the couches and tables in the nonprofit’s waiting room were hardly visible. After delivering the baskets, the law firm presented Renee Bradshaw, executive director of Family Crisis Council, with a check for $3,000. Bradshaw was awestruck by the gesture. 'It is indeed a wonderful thing that they have done,' Bradshaw said. '“'The ladies and the children will be greatly appreciative of being able to start out with items they need. It took a lot of work and it means so much to me.” Family Crisis Council works to empower victims of rape, sexual assault, incest, and domestic violence to take back their lives. The law firm donated the baskets and money through its Wallace & Graham Gives charitable program. The firm says it donates $50,000 annually to a number of local organizations working on causes such as education for underprivileged youth, mental health counseling for veterans, sustainability and more. Wallace & Graham brought the baskets to Family Crisis Council during Sexual Assault Awareness Month, an annual campaign that aims to raise awareness about the causes and risk factors for sexual assault and empower individuals to take steps to prevent it from happening. The baskets will be given to victims of domestic violence and sexual assault when they leave the Family Crisis Council’s communal living shelter. The shelter is often the only place many victims have to go after leaving an abuser or dangerous situation. “The main purpose of the shelter is to give them a safe haven and then start working with them to move forward,” Bradshaw said. The baskets are intended to supply victims with products they may need when starting over. Half of the baskets are for mothers and contain items like Clorox wipes, towel sets, blankets, and other hygiene products. The other half are for children and are packed with soccer balls, cups, snacks, and games. “We hope the survivor packages and our donation will help victims of violence feel deeply supported in this community,” said Whitney Wallace Williams, a partner at the firm and chair of the Wallace & Graham Gives committee. “We want to empower victims with the resources and courage they need to end the cycle and to pursue a new ending for their story.” The survivor baskets and donations were proposed and executed by Wallace & Graham paralegals Renee Wilcox and Brianna Earnhardt. The two have a special appreciation for the council’s work. Wilcox’s father worked in law enforcement as chief of police and her family recognized the impact that a successful women’s shelter has on improving the mental and physical well-being of violence victims. Earnhardt’s mother has spent her career at the Rowan County Department of Social Services and knows how critical victims’ access to resources can be during their deepest times of need. The baskets will be another resource the Family Crisis Council deploys to help survivors who leave its shelter. The council also tries to make the process easier by providing mattresses, bedding, and local resources for housing, food and employment. “We try to help them with anything they need to get off their feet,” Bradshaw said. Temporary shelter for victims is one of the many services provided by the Family Crisis Council. Formerly the Rape, Child and Family Abuse Crisis Council of Salisbury-Rowan, the nonprofit was incorporated in April 1978 and given a grant to develop a service center for victims of family violence. From the time the nonprofit’s first shelter opened in 1990 to December 2016, the Family Crisis Council housed 2,478 women and 767 children in its shelter. Family Crisis Council helped more clients last year as documented instances of sexual assault increased. In 2020, there were 179 calls to Rowan County 911 regarding sexual assault and related offenses. In 2021, that number increased to around 226 calls. Last year, Family Crisis Council served a little over 700 clients, including 89 individuals who stayed in its shelter. Family Crisis Council operates a 24/7 support hotline for victims and can help people who have been sexually abused with safety planning, housing options, case management, and counseling. The nonprofit helps victims file protective orders electronically and provides court advocates who accompany victims to criminal and civil proceedings. “We really work with people from the moment of victimization all the way through the moment we call survivor hood,” said Spencer Dixon, Family Crisis Council’s resource and media coordinator. All of the services Family Crisis Council offers are free of charge. Family Crisis Council is funded by grants, foundations, governments and individuals. The council is hosting the Stomp Out Sexual Assault 5K at 9 a.m. on April 23. The race will be held at Knox Middle School with runners racing on the Salisbury Greenway. All proceeds will benefit the Family Crisis Council. Registration can be found online at runsignup.com. The council is also planning its sixth men’s fashion show for June 4 at the Salisbury Country Club. More details will be available closer to the event. More information about Family Crisis Council can be found online at fccrowan.org."
    },
    
    {
    "id": "104",
    "headline": "Wastelands: The True Story of Farm Country on Trial",
    "date": "Tuesday, April 5, 2022",
    "author": "Daniel Baror",
    "source": "Publishers Weekly",
    "body": "In this exceptional account, Addison (A Harvest of Thorns) reveals how a cadre of dedicated lawyers and long-suffering North Carolina families fought, and won, against Big Pork. In 2013, attorney Mona Wallace took on the case of 26-year-old Brandon Taylor, who died from toxic fumes while working at a Smithfield packing plant in Clinton, N.C. This case, which ended only in a fine for Smithfield, was the prelude to a series of major environmental nuisance cases. Over the decades, Smithfield, a food corporation giant, had brought five million hogs to four North Carolina counties, polluting the air and water with billions of gallons of hog urine and feces. The rural, mostly Black families who lived near the farms complained about the stench to no avail. Then, starting in 2018, Wallace and her colleagues brought five successive cases to court. Addison dramatically details the massive legal legwork involved, the heartbreaking stories of the families, the courtroom battles, and the intimidation tactics and social media smears by Smithfield. In 2020, after losing an appeal, Smithfield agreed to settle for an undisclosed amount and was forced to change its pork production for the betterment of the people and land of North Carolina. As John Grisham notes in his foreword, this David versus Goliath story has a happy ending. This high-stakes legal saga is a must-read. Agent: Daniel Baror, Baror International. (June)"
    },
    {
    "id": "103",
    "headline": "Team Health Hit With Suit Alleging Inappropriate Billing",
    "date": "Friday, March 25, 2022",
    "author": "Alia Paavola",
    "source": "Becker's Hospital Review",
    "body": "This is a repost from Becker's Hospital Review, to view the original article, click here. A self-funded employer in Louisiana is suing Knoxville, Tenn.-based TeamHealth over what it considers inappropriate billing and 'systematic overcharges.'  The Louisiana Municipal Risk Management Agency, which pays medical expenses for service department personnel like police and ambulance workers, filed the lawsuit March 21. The lawsuit alleges TeamHealth defrauded the employer and others similarly situated by 'deliberately' using inflated Current Procedural Terminology codes, also known as upcoding.   'TeamHealth billed using CPT codes appropriate for higher levels of care, when in fact such services were neither appropriate nor provided,' the lawsuit alleges.  In the lawsuit, Louisiana Municipal Risk Management Agency alleges that TeamHealth overbilled 81 percent of its claims and often billed for services rendered by physicians when they were performed by a physician assistant. The employer also argues that TeamHealth is structured to make it harder to identify fraud and inappropriate billing as it is made up of more than 100 local subsidiaries. Although the company is split up with local subsidiaries, it has one central billing office that is 'controlled in a cartel-like manner,' the lawsuit claims.  'Because TeamHealth uses many different entities and names to carry out its billing scheme, it has been able to mask the enormity of its enterprise and the sheer number of times it has carried out this scheme,' the lawsuit reads. The employer is seeking class-action status for the lawsuit. The proposed class includes every self-funded payer that has paid for TeamHealth's services over the last four years. The Louisiana Municipal Risk Management Agency is looking to recover damages, restitution and injunctive relief.  'This lawsuit is almost identical to a frivolous lawsuit filed by the same attorneys last year which was quickly dismissed,' Team Health said in a statement to Becker's Hospital Review. 'TeamHealth engages professional coders who follow CMS and American Medical Association guidelines for coding emergency medicine claims. TeamHealth's coding is subject to a rigorous quality assurance process both internally and externally and is consistent with nationally published database averages.'"
    },
    {
    "id": "102",
    "headline": "Louisiana Insurance Company Sues Over Alleged Overbilling",
    "date": "Friday, March 25, 2022",
    "author": "Kendall Heebink",
    "source": "Law Street Media",
    "body": "This is a repost from Law Street Media, to view the original article click here. Louisiana Municipal Risk Management Agency filed suit in the Eastern District of Tennessee on Monday against defendants Team Health Holdings, Inc., Ameriteam Services, LLC, HCFS Health Care Financial Services, LLC, and ACS Primary Care Physicians Louisiana PC. The suit alleges that the defendants were a part of a scheme which 'systematically overbilled both governmental and private insurance and self-funded payors' like the plaintiff. Defendant Team Health Holdings, Inc. and defendant Ameriteam Services, LLC are said to “own and control the system of affiliated entities operating as and collectively referred to herein as TeamHealth.” TeamHealth is a contractor at various hospitals where they provide staffing, operation, and billing services. The plaintiff is an administrator of a “self-funded insurance plan to cover medical expenses of employees of police departments, fire departments, ambulance and other important local services.” Team Health regularly provides enrollees of the Plaintiff’s self-funded health plan with treatment, after which they bill the plaintiff according to certain codes. The complaint explains that the TeamHealth organization implemented systematic overcharges across their system and to the plaintiff as a part of a larger scheme. The deliberate business model was purportedly orchestrated in a way that made the overbilling undetectable by traditional audit metrics. Defendant TeamHealth allegedly used “improperly chosen Current Procedural Terminology (CPT) codes in conjunction with the billing.” The defendant had previously represented to the plaintiff that the codes were true, accurate, and complete. TeamHealth was “upcoding” their CPT codes, charging the plaintiff for higher levels of care when it was not appropriate nor provided. The complaint cites a violation of the Racketeer Influenced and Corrupt Organizations Act (RICO), conspiracy to violate RICO, and unjust enrichment. The plaintiff contends that “the scheme defrauded the Plaintiff and similarly situated plans cumulatively of millions of dollars.” As a result of the defendant’s alleged improper and damaging healthcare billing practices, the plaintiffs are seeking class certification, favorable judgment on all counts, monetary damages, equitable and injunctive relief, litigation fees, pre- and post-judgment interest, and any other relief deemed just by the court. The plaintiff is represented by Parker & Crofford, Wallace & Graham, Varnell and Warwick, and Lemmon Law Firm, LLC."
    },
    {
    "id": "101",
    "headline": "Cansler v Vidant",
    "date": "Friday, March 25, 2022",
    "author": "Wallace & Graham, P.A.",
    "source": "",
    "body": "Today W&G filed a class-action lawsuit against hospital chain, Vidant Health, which operates 9 hospitals in Eastern North Carolina. The Complaint alleges Vidant has deceptively hidden prices and charged rates grossly exceeding any reasonable value for the health care services provided. Our firm seeks to increase transparency and fairness in hospital billing practices. “North Carolina has some of the highest healthcare costs in the country. We believe conduct like this is one reason why,” said Mona Lisa Wallace of the law firm of Wallace and Graham. The complaint is available here:"
    }
    
    ]