[
    {
    "quote": "I just want to thank you all who worked on my case.  Although it is bittersweet, I am very pleased with my settlement.  Everyone I’ve had the pleasure of talking to has been very professional, yet personable as well.  I feel like I couldn’t have chosen a better group.  I highly recommend your fir to anyone needing this type of legal assistance.  Again, thank you!",
    "name": " Linda Cartee"
    },
    {
    "quote": "First want to say thank you so much for the years of service in my Pop’s (Leroy F. Peck) case.  If I could trade this money for just one more day with my Pop’s, I would.  I miss him so much.  I know he’s in a much better place than I, away from pain beyond description.  I am a little Daddy’s girl and forever will be just that. Your company went well and beyond expectation, that I can’t say thank you enough for the closure.  Now I can begin to heal a little better and rest easier because I can finally put this chapter of heartache to an end. This year for my Pop’s birthday I hope to be celebrating it at the mountains.  The only thing on his bucket list we didn’t do together, but it’s okay in spirit he will be there with me.  Bless you and all associates at Wallace & Graham.",
    "name": " Millicent Y. Truesdale"
    },
    {
    "quote": "Over the past twenty years, Wallace and Graham have helped me with the asbestos and workers’ compensation claims.  Everyone at the law office has been professional, friendly and helpful, especially Amanda.  She has gone out of her way to keep me updated on the details of my case.  I thank you all for your aid with my claim and the claims of my fellow Dayco workers.  I have already and will continue to recommend their services.",
    "name": " Ned H. Price"
    },
    {
    "quote": "When my dad began his workers’ compensation claim with Wallace and Graham due to failing health from chemical exposure, little did we know he would pass away from cancer within two years.  Wallace and Graham helped our family finish the journey and was able to get us monies which covered his funeral expenses and more.  They guided us each step of the way with very professional staff.  I highly recommend them!",
    "name": "Ainslee Gentry Moss"
    },
    {
    "quote": "Thank You, Wallace & Graham for all of the support and hard work you have given to me and my family all these years.",
    "name": "Al"
    },
    {
    "quote": "All I can say is that I wish Jack and Shelby were here to receive this.  I know they would be very grateful for all the hard work that Wallace and Graham put in getting his workers’ compensation claim settled.  I want to personally thank you on advising me after Shelby passed.  I had no idea on how this was going to be handled.  This all has been very emotional for me.  Thank you for making this easy on me.",
    "name": "Amanda Jill Shaw"
    },
    
    {
    "quote": "Dear Mrs. Wallace, Thank you for taking time out of your busy schedule to call me Saturday to discuss my husband's case. I was shocked to know that you were STILL working on my behalf. I am amazed and still amazed! In life, there are many paths you can take and many people who share the journey -- but it is the special people who help you along the way, and the most important people who care enough to give of themselves unconditionally. Thank you for being one of these special people. I also say this for Attorney Graham and staff. ",
    "name": "Annie"
    },
    
    {
    "quote": "Wallace & Graham is an excellent and very professional law firm. The attorneys did an outstanding job of negotiating my case with other insurance companies and keeping me informed of the progress.The paralegals were friendly and very eager to assist me. I will definitely recommend, without reservation, Wallace & Graham law firm to all my friends and family members.",
    "name": "Annie"
    },
    {
    "quote": "I would like to personally thank you for everything you have done for myself and my late husband over the years.  The hard work and dedication you have showed does not go unnoticed.  I am grateful for your consistent efforts to ensure that my husband and I got the justice that we deserved.",
    "name": "Annie B. Redmon"
    },
    {
    "quote": "Special thanks to Whitney Wallace for assisting me with my workers compensation claim. Whitney and her paralegal, Megan, were patient and understanding. They stayed on top of any issues and assisted me through the entire process. Whitney reassured me that it was ok to seek the benefits that I was entitled to receive. The dedication and hard work of Whitney and Megan resulted in a settlement that I am very grateful to have received. ",
    "name": "Anonymous"
    },
    
    {
    "quote": "Whitney & Megan did the most amazing job I could ever ask for handling my case. Not only in handling my case, but also in making sure me & my family were being taken care of and was alright. I couldn’t have asked for a better attorney to handle this case for me. Me and my fiancé and my daughter were truly blessed to have Whitney fighting for us. And even though I walk away with issues from incident at former employers, Whitney did everything possible that she could to make sure I was taken care of forever. It was a true blessing to have ever met her and have her represent me. I am truly thankful. – Ant",
    "name": "Anthony"
    },
    {
    "quote": "Thank you as always Krystal for all you do and continue to do for us! The entire office/company rocks! Very appreciative to you all.",
    "name": "Barbara"
    },
    
    {
    "quote": "I would like to thank you so much for doing all you are doing for me. I wish my husband was here with me. I miss him so much. He is my rock and solemate forever. He would thank you too!",
    "name": "Barbara"
    },
    {
    "quote": "Mesothelioma is a devastating disease. Wallace & Graham not only made sure my family did not have to worry about the financial burden created by the disease, but also helped us address the myriad of daily living and healthcare challenges that accompany this diagnosis. Their assistance went far beyond just dollars and cents as they provided a comprehensive support system that included access to the best healthcare available. Wallace & Graham has outstanding legal expertise and experience, but perhaps more importantly, they demonstrate true empathy and caring for their clients. ",
    "name": "Barbara"
    },
    
    {
    "quote": "Thanks to all of you for what you have done for me and my family since the death of my husband.  Wishing you all the best of holidays this year.  Sincerely, Betty Hammontree",
    "name": "Betty"
    },
    {
    "quote": "I have been working with Wallace & Graham since late 90s.  When my husband William Risner passed Nov. 24, 2001, they have been super to find any & all funds that are due me being a widow.  Not only are they wonderful people, but all their staff.  My husband passed from asbestos & small cell carcinoma.  Since then they have worked to settle all claims related to the illness.  This has taken several years & I appreciate their time and effort.",
    "name": "Betty Ricker Risner"
    },
    {
    "quote": "I just wanted to tell you I appreciate all that you have done for me. Thanks again. ",
    "name": "Bill"
    },
    
    {
    "quote": "I am so happy to have chosen Wallace & Graham as my attorneys for my On The Job Injury (OJI). I am particularly glad that Tiffany Mack was assigned to defend and process my case. I am satisfied with the settlement and certainly recommend other clients to use the services of Wallace & Graham attorneys.",
    "name": "Bisalla"
    },
    
    {
    "quote": "Thank you Whitney for all the time, phone calls, and emails that you blessed us with. ",
    "name": "Bob"
    },
    
    {
    "quote": "I am so pleased and happy with Mark Doby as my attorney. He has been I my corner with Asbestos, leukemia, dealing with my Ins. Folks while I’ve been on my death bed. He’s released me from the stress of my sickness. He continues to be in my corner. Thank you for your support and providing me with Mark. I cannot tell you how pleased me and my family are. Please make sure Mona Lisa and Bill see this note. I’ve been so sick and I do thank y’all so much.",
    "name": "Bruce Rhyne"
    },
    {
    "quote": "Dear Wallace & Graham, P.A., Attorneys At Law, Associates, Staff and Receptionist: I, Chancie M. Pryor and family, are so privileged and thankful for your help, support and the time well spent of your care and concern on my behalf concerning my workers’ compensation claim.  I would like to commend your sound knowledge, skills and courtesy in your field.  Your stood by me through and through and we value your principles of honest, integrity and clear explanations.  Do know that whenever I need any legal help of any legal matters, you will be my first choice.  I will gladly recommend you to all my extended family, friends and associates.",
    "name": "Chancie M. Pryor"
    },
    {
    "quote": "Thank you Wallace and Graham for a very wonderful Christmas present. God Bless!",
    "name": "Charles"
    },
    
    {
    "quote": "I want to thank every one at Wallace and Graham, this means so much to me. God Bless. ",
    "name": "Charles"
    },
    
    {
    "quote": "Wallace & Graham litigated two compensation cases for me and they explained my rights under the workers compensation laws and what I was entitled to. Wallace & Graham assisted my other legal matters through an associate named Cindy Cobble, who always directed me to someone to help me. Wallace & Graham is not just my law firm there are my friends as well. I would recommend them to any and all my family, friends and associates.",
    "name": "Charles"
    },
    
    {
    "quote": "After being told by 3 Doctors that you have Stage 4 terminal cancer no matter what you were doing in life it suddenly goes into shock, hurt, fear and disbelief. Although, I am 62 and was trying to continue to work 40 hours a week, I was missing 20 or more days due to chemo and radiation treatments or being too sick to work. After talking to the Social Security Administration and hearing about the 'paper work', 'interviews' and 'filings', it was overwhelming to me. So, I contacted Mark Doby at Wallace & Graham Law Firm in Salisbury. He my interview with a Disability Examiner and had my paperwork filed on August 1, 2014. On August 19th, 2014 I received notification that Social Security had approved my disability effective August 15, 2014. Thats just 2 weeks! Thank you Mark and all of the staff at Wallace & Graham for making my remaining life a lot less stressful! Carl R. Williams Jr. Salisbury,N.C.",
    "name": "Chuck Williams"
    },
    
    {
    "quote": "Whitney is not only my lawyer, she has grown to be my friend. I think of the law firm as my family. If something didn’t go right, all I had to do was call and Whitney and Megan would get it handled for me. Whitney didn’t settle for the first offer from the defendant, but took the time to make sure that it would benefit me too.",
    "name": "Claudette"
    },
    {
    "quote": "Thanks for everything this firm has done for us!",
    "name": "Daisy"
    },
    {
    "quote": "Wallace & Graham has been very helpful to us over the years regarding my late husband’s claims for his asbestos exposure. Everyone that we have dealt with have been very professional, kind, and efficient.  I would recommend them to anyone who has been exposed to harmful substances such as my husband was.  Thank you so much for your help through the years.",
    "name": "Daisy M. Hollars"
    },
    {
    "quote": "I am so thankful we chose Wallace and Graham to handle our case.  Many thanks to Ed, Amanda, Mike, Coryna and others who worked diligently for us on my father’s workers’ compensation claim.  You were always so kind to us and willing to answer all our questions so we could understand this process. Thank you again for all your hard work. God Bless, Dale Waller CovingtonDaughter of Bobby Gene Waller (D)",
    "name": "Dale Waller Covington"
    },
    {
    "quote": "Without exception, Wallace and Graham is the best law firm I've ever dealt with. Everyone was polite, professional, responsive, and knew their part in the process. They have no phone-a-rama. A real person answers the phone, who, by the way, has the most beautiful, calming voice I've heard in a long time. I was always transferred to the correct person the first time. Whitney [Wallace Williams] and her staff were very thorough and patient. They involved the right people, at the right time, which was evident by the results. The experts they involved also actually helped mitigate the health effects resulting from years of working rotating shifts. If all personal injury attorneys took the same interest in the wellbeing of their clients, large companies would soon be forced to truly look after the health of their employees, instead of just giving it 'lip-service'. Many thanks to the entire team.",
    "name": "Dan Helton"
    },
    
    {
    "quote": "I recently received a $270 check from Wallace & Graham for workers' comp reimbursement for some of the costs that were deducted from my settlement. I wanted to take the time to thank you for your efforts on my behalf. What a better time than during the Christmas Season to find unexpected income. Thanks so much for all you and your team do at Wallace & Graham.",
    "name": "David"
    },
    
    {
    "quote": "Wallace & Graham worked for me for my best interest against insurance companies. It took a long time to settle with the insurance companies, but in the end it was worth the wait. At times it was Ed Pauley up against five insurance lawyers. But, Ed all ways came out on top. No layer could have done the job Wallace & Graham done for me. I have told lots of people about Wallace & Graham. You cannot do better. You can call me anytime I will tell anybody you are the best. I am really glad to talk and visit all of you at the office. Thank you for letting me tell what you all mean to me. ",
    "name": "Davis"
    },
    
    {
    "quote": "Our family was in need of legal help in 1993. I watched a very professional process with deep concern for my mother’s wrong doing from a large corporation. Mona Wallace fought for my mother’s case and won. In 2009, when I was in need of a very professional attorney, without a doubt, Wallace & Graham was my choice. Whitney Wallace and Megan Hinson are experienced with the workers’ compensation process. It is a wonderful relief to know someone cares and is willing to fight so hard for my rights. It is also a pleasure to work with the professional staff at Wallace & Graham.",
    "name": "Deborah"
    },
    {
    "quote": "My father started his workers’ compensation claim before he passed away.  The Wallace & Graham Team was very compassionate and understanding when I called to let them know that he was deceased.  The team was very easy to talk with and the transition was smooth, the case picked up where it was left off with dealing with my father.  The Wallace & Graham Team is very confident with the type of cases in which they are experienced in dealing with.  I would personally recommend Wallace & Graham to settle a claim of this nature.  There are not enough words to express how I feel about this group.Sincerely, Diane Wilson, Daughter of Herbert Eugene Allison",
    "name": "Diane Wilson"
    },
    {
    "quote": "Cathy Williams, Ed Pauley, Stephanie Kafitz and their support staff were superior in representing my best interest in my workers comp case. Cathy and Ed were always readily available by phone to discuss any issues. I never had to play “phone tag” that is so common today.I was especially impressed with Cathy’s extensive research and follow-up with many doctors regarding the damages welding does to the eyes. Ed’s amazing knowledge of asbestosis and his “don't give up” encouragement can’t be matched!",
    "name": "Donald"
    },
    {
    "quote": "Thanks to the Wallace & Graham Attorneys at Law for first taking my workman’s compensation case, second for all their hard work bringing it to a close.  I highly recommend their firm for this type of settlement.",
    "name": "Donald Whitford Waters"
    },
    {
    "quote": "Donnie and I feel fortunate to work with the law firm of Wallace & Graham. This is a team second to none which is professional in approach, courteous in demeanor and always displays sensitivity for their client’s needs. The amount of time and effort solely devoted to our claim making sure we were rightfully compensated for exceeded our expectations. We will recommend the law firm of Wallace & Graham above any other law firm. ",
    "name": "Donnie"
    },
    
    {
    "quote": "I would like to thank all the people who worked on my case.  Mr. Pauley, Amanda Norton and all the rest.  I had heard so many good things about Wallace and Graham, PA and now that they have helped me on my workers’ compensation case, I see for myself what a number one class action establishment of attorneys they are.  Nothing but good comments!  They keep you informed if you don’t understand something and they do what they say they’ll do!  I give them five stars.",
    "name": "Elaine Ray Davis"
    },
    
    {
    "quote": "Whitney and Megan have been wonderful over the past 2 years. They both have taken time out of their busy schedules to answer any questions, comments or concerns. I would be glad to have them on my side again if I ever needed. In my opinion you can't go wrong with this team.",
    "name": "Elisha"
    },
    {
    "quote": " Wallace & Graham fought for my best interest against the company. They took their time and tried to help me understand the process and what I was entitled to under the law. I would recommend Wallace & Graham to others with legal needs. Megan and Whitney made this seem easy when I know it was difficult. ",
    "name": "Fred"
    },
    
    {
    "quote": "I was gratefully pleased and surprised by the promptness and effectiveness in all matters concerning multiple cases that Wallace & Graham was able to bring to fruition.  Amanda and the rest of the staff covered by downfalls and forgetfulness and made sense out of my chaos.  Ed Pauley kept me informed on matters and I feel maximized the outcome for equitable settlements.  Highly grateful for all the work performed.",
    "name": "Gilbert Alexander Miller"
    },
    {
    "quote": "I feel that Whitney [Wallace Williams] and her team did a remarkable job for me on this case. Thanks Whitney and staff!",
    "name": "Glen Hayes"
    },
    
    {
    "quote": "To Mr. Graham and Mona Lisa and all of the staff thank you so much for the check i received today, It sure came in handy with my medicine being so expensive. Ive really enjoyed your firm and have no complaints, god bless all of you. ",
    "name": "Glenn"
    },
    
    {
    "quote": "I had a great experience with the group. Both Meagan and Whitney have done a great job. Very happy they took my case and helped us get through everything over the last 5 years. Great job to everyone!",
    "name": "Greg"
    },
    
    {
    "quote": "We just want to express our appreciation for all your efforts on our behalf. You have helped make a huge positive in our lives! ",
    "name": "Gwen"
    },
    
    {
    "quote": "To the Wallace and Graham firm, I am pleased with the handling of my workers’ compensation case. Thank you for keeping me informed. I would use your firm and would recommend you to someone else. Again, thank you so much for all you did. I am humble and thank God for each one that were involved.",
    "name": "Hattie Lou Smith"
    },
    
    {
    "quote": "Wallace & Graham law firm has gone far beyond my needs to help me with my legal concerns. From the first day I walked into their office, I was greeted by two of the nicest ladies at their front desk. These ladies made my wife and I feel totally welcomed and interested in our needs. I came here with workers comp questions and Whitney Wallace took my case. She greeted us and we felt like part of their family. Whitney was always there to answer all my questions. Please call Whitney if you have any worker comp concerns. I was also having hearing problems and Mark Doby started asking concerning questions and before I left there he was filing a hearing claim. He was awesome with my hearing claim. After years of not hearing well, he got me hearing aids and more. Thank you Mark for all the hard work you did for me! My wife and I would also like to thank Megan Hinson who handles all of our in between questions during our claims, you are the best! You were always there when we needed someone. If ever in need of a good lawyer, please contact Wallace & Graham law firm. They are the best! We love you guys! ",
    "name": "Howard"
    },
    
    {
    "quote": "Wallace & Graham is the best law firm in the country. I have been a client of their office for several years and always have gotten positive results. Mark Doby handled my disability case and had been turned down twice by Social Security and Mark went with me to the hearing and was approved immediately – Mark Doby did an excellent job for me. Ed Pawley has always helped me and my family on several cases and always 100% complete satisfaction. Ed has never lost a case for us. Both of these attorneys are not only attorneys but friends as well.",
    "name": "Ivan"
    },
    {
    "quote": "Thanks for everything and have a blessed day.",
    "name": "James"
    },
    {
    "quote": "I would like to thank you very much for all the help ou have given me during my time of need. I think it started about three years ago, I didn't no if I could get anything for workers' compensation or not, but both of you [Mark Doby & Frieda Willett], started right on it. I have been very satisfied with everything. Frieda and Mark you have help me so very much, I say thank you, thank you very much from my heart. My wife says thank you also, again I say I have been very satisfied client of Wallace & Graham. If I need someone later on I know who to call. May God bless both of you.",
    "name": "James"
    },
    {
    "quote": "It is my belief the Wallace & Graham is a good choice for legal counsel. I have been lucky to have found a legal team that is solid in there foundation. My family had the unfortunate cause of having to find legal counsel for a fatal crash involving my father back in March 2013. He was killed by another driver while riding his motorcycle. The crash was not his fault. When my family and I first approached the Wallace & Graham team they were upfront and forth wright about the reality's we would be facing in the case. To this day they have not been found to have steered us in the wrong direction or have spoken falsities. We are treated as we are family. They were diligent and kept us informed regularly as things had changed or not. If there was something that was not a good decision to be made. We were told about it out front whether we liked it or not. This is a rare reality in this world now. If it were not for being blessed to have found or being referred to Wallace & Graham as legal counsel, I am sure that I would have lost my mind months ago with the train wreck that is my Father's crash. The legal counsel that is the state is not as efficient, caring, fourth wright or honoring toward the victim's family as true professionals should be. As the Wallace & Graham Team is. I will be following up with them on other matters in the near future. In closing. It is my opinion and belief that it would be a smart decision for anyone to make, as to seek and acquire the team of Wallace & Graham as their legal counsel. In my first experience with them, you will not regret it.",
    "name": "James"
    },
    {
    "quote": "I never thought I would have success in my workers’ compensation case, but Wallace & Graham really helped me. I was very happy with the results we got and Ed and Trish did a great job. They treated me like I was their number one client. They never gave up.",
    "name": "James"
    },
    {
    "quote": "I want to thank Ed and Amanda for all your support and help over the years.  It has been a very difficult time and with your help you made it easy.  If I had questions about Mark’s workers’ compensation claim, you were always there to answer them.  I will always appreciate your kindness and support throughout this.  Thank you so much for everything.  Thank you for being so kind to Mark.",
    "name": "Janet M. Finley"
    },
    
    {
    "quote": "An accident can happen in a blink of a eye, no matter how experienced or alert you may be, but remember the company or insurance people will never let you forget it's your fault. I felt they were rushing me back to work and I was just a number not the employee they hired me to be. When I called Wallace & Graham, I was at my highest level of stress next to depression, my health was very weak and I was mentally drain. When Wallace & Graham took my case I felt like a part of Wallace & Graham family, I was protected. They were knowledgeable and very professional. There staff was very polite, helpful, outgoing, basically they took care of me. My family and I are forever thankful for Whitney and Megan's help.",
    "name": "Jeannette Price"
    },
    
    {
    "quote": "Wallace & Graham successfully fought my case against many manufacturers and insurance companies. Many thanks to attorney Mike Pross, paralegal Beth Ousley, and the staff and complete support of this highly professional firm. I would highly recommend this firm for all your legal needs. Put a winning team on your side - a team from Wallace & Graham. Thanks! ",
    "name": "Jeremy"
    },
    
    {
    "quote": "This has been one long hard battle and no one else would have put up with this workers comp case this long with such heartfelt compassion.  In fact I had two firms before you here in Salisbury – one I fired and one fired me!  But I came to you with a very hard case with multiple injuries and you have stayed with me and we finally end this journey with a huge win!!! Thank you.",
    "name": "Jerry McLaughlin"
    },
    {
    "quote": "Dear Wallace and Graham, Just saying thank you is not enough to express what I feel in my heart for all you and your staff of many im sure have done for us. I can't imagine all the research, phone calls, court duties, and endless hours of hard work that has been done over the last several years. Im saying thank you with true feelings. May God bless you and have a wonderful holiday. ",
    "name": "Jill"
    },
    
    {
    "quote": "Thank you for your support. ",
    "name": "Jillian"
    },
    
    {
    "quote": "Dear Wallace & Graham, I just wanted to say thank you for all the effort and persistent in filing all the claims over the years. I think it was 2001 when I got my first settlement check, and each year since there has been additional settlements. I appreciate the work your office has done to help out so many asbestos workers, and communicate frequently important issues that are in litigation. You guys are the best! Sincerely, Joel Jessup",
    "name": "Joel Jessup"
    },
    
    {
    "quote": "I want to thank Wallace and Graham for looking out for their clients. Thanks Bill. ",
    "name": "John"
    },
    
    {
    "quote": "It's a shame that in this day and time that employer's of business, companies and Corporations still have disregard for the safety and well-being of their employees, but the truth and cold hard facts of this is reality. My hope is that this review of Wallace and Graham Law Firm will open people's eyes and ears if you are a victim of negligence and neglect of such. When faced with a work related injury or illness it is a can be a very dark event and time for someone it can also be taxing on your mind,body, and spirit not to mention financially, you need a light to guide you, you need a voice to be heard, you need a firm that will strap on armor and go to war against a Goliath a firm that will not waver or falter not just take some meager fare payout to make you go away. From the moment I contacted them the professionalism of all involved was immeasurable. Always treated as if my case was the only one that mattered, from the numerous trips they made to my house, to discussions in detail of what my case entailed, every question answered, every plan, process, procedure, signed paper was explained into depth, always kept updated and informed of what was being done, where the case was headed and what the next step would be, what to look for in every aspect of my case. Everyone from bottom to top always treated me with the upmost respect and importance. There is no measure of gratitude to the team of Ed Pauley and Trish McDermott and all others involved that expresses my feeling there are no more capable mind's or hand's that could handle and succeed with any case. Don't be deceived with other law firms empty promises and smoke and mirror tactics with their ambulance chasing advertising. Wallace and Graham let's their past proven track record provide the proof and their reputation speaks volumes for itself and their results. If you are facing a life changing decision of what to do or who to turn to concerning employer Negligence and neglect to your health and well-being I urge strongly to give Wallace and Graham a call let them put certainty into an uncertain state of mind.",
    "name": "John Craven"
    },
    {
    "quote": "I am grateful for your tireless work on my behalf and send my sincere thanks. You were always patient with my questions and efficient and courteous with your answers. There was a Medicare lien filed against our settlement and you worked “over and above” to get a good resolution for us. The money got us out of credit card debt and left some in the bank for rainy days! I send my appreciation to everyone who worked on my claim. Sincerely, John D. Yandel",
    "name": "John D. Yandel"
    },
    {
    "quote": "I contacted Wallace & Graham and spoke with Whitney Wallace. She made me feel very comfortable when talking with her. She explained to me the things I needed to know to go forward with my case. She was very helpful and that’s why I went with Wallace & Graham. Whitney and everyone at the firm has been great. I would recommend Wallace & Graham to all that needed legal help. In my personal case I will be glad when it’s over, but I know cases take time, and I have time because Wallace & Graham gave me their time. Thank you. ",
    "name": "Johnny"
    },
    {
    "quote": "Wallace & Graham have been there for me every time I needed them. They help me understand the Social Security Disability process and won my case. Whitney and Megan continue to be there for me through my workers compensation case, answering any questions I have. They are not only handling my case but are working with other family members of mine, and we all love the job they are doing for us. Thanks Whitney and Megan. Y'all are a great team.",
    "name": "Josh"
    },
    
    {
    "quote": "In 2008, my husband was diagnosed with lung cancer that resulted in having his left lung removed.  In 2009 while he was having chemo for his lung cancer due to asbestos, he decided to call Wallace & Graham based on the advice of a co-worker.  My husband had told me prior to his lung cancer diagnosis that he would never take that step to make that call due to loyalty to his employer. But we are so thankful he did.  Thank you for your team who stayed on the journey even after my husband was gone fighting for any compensation due to the awful effects of asbestos.  I know you lost a team member too, Mike Pross.  Losing someone like Mike was so devastating.  Many thanks to Ed, Coryna and Amanda for all you have done to not letting up on the claims on behalf of John and his family.  I realize now that it takes special people to work diligently when helping clients file these claims.  You stayed the course and I thank you.",
    "name": "Judith R. Pettigrew"
    },
    {
    "quote": "Whitney and Megan were great! If I ever need a lawyer again I will definitley come back to the firm. ",
    "name": "Justin"
    },
    
    {
    "quote": "I would like to express my sincere appreciation to this law firm.  Words can’t express how grateful I am for their support, empathy and polite conversations.  They listened to me and I am overwhelmed by their generosity!  They showed a great concern for me during a difficult time.  They were very knowledgeable with the case and helped me understand it all.  I will forever be grateful and highly recommend them if you need to be represented.",
    "name": "Kelly C. Almond"
    },
    {
    "quote": "Thank you Whitney for all the time and phone calls, and e-mail, that you blessed Bob and I with (I thank you Jesus). This is a small token of appreciation. ",
    "name": "Kirby"
    },
    
    {
    "quote": "I just want to tell you I appreciate all that you have done for me! Thank you!",
    "name": "Kirby"
    },
    
    {
    "quote": "Dear Wallace and Graham, Just a short note to say 'Thank You' for handling my asbestos case, all the work you and your staff did, the medical checks that were performed and the entire work that you all preformed on my behalf. My wife and I are very grateful to all of you! Thanks again!",
    "name": "Larry"
    },
    {
    "quote": "Whitney and Megan did a great job, really pleased! Very nice people. ",
    "name": "Larry"
    },
    
    {
    "quote": "Whitney and Megan are without question the most professional and polite people I have ever met. They explained every step of the process and made me feel very comfortable. I felt complete trust in their guidance and wisdom. This was an extreme life changing event for my life. I feel honored to have them beside me as I enter a new chapeter in my life. I hope I never need this service again and will suggest them to anyone in need. I would consider them friends!",
    "name": "Lawrence"
    },
    
    {
    "quote": "To the Wallace & Graham Firm: I would like to say thank you all for helping me and I would recommend you and your team to anyone.  From my son and I, thank you for your team’s help.  They were very respectful and considerate to all my needs.  I could have not done it on my own.  I give a big shout out to each of you from the bottom of our hearts.  Bless each and every one of you! Sincerely, Lisa and Ron Hamby",
    "name": "Lisa and Ron Hamby"
    },
    {
    "quote": "Thank you! I have a grandson graduating college this year and it's all paid for in full, thanks to you!",
    "name": "Loretta"
    },
    {
    "quote": "In May 2013, my wife was involved in a horrific car accident with another driver who had run a red light. Her injuries were severe and life altering. Even with health insurance, her loss of income and medical expenses were starting to become a financial hardship and affecting the way of life we once enjoyed. A close friend had suggested I contact the law firm of Wallace & Graham to see if they may be able to help. He had used them in the past and was very satisfied with their service. In the initial consultation, my wife and I met with Wallace & Graham who explained to us our situation, how insurance works in the 'real world' and the options that were available to us. Some things she told us were depressing but, I appreciated her honesty and candor on our options and what they could do to help. After a brief discussion with my wife, we hired Wallace & Graham to represent our family with the insurance companies and all legal matters concerning this accident. Throughout the progression and settling of our case, I was very pleased with the communication process and felt like our inputs were wanted and valued. We were part of the team, not just passive spectators. Mona worked very hard for us and the results were beyond our expectations.",
    "name": "Mark"
    },
    
    {
    "quote": "I wish to tell each of you that you will always be on my mind as to what you have done for me. I will never forget you and welcome any email or anything that I can receive from you. You people are just one wonderful group. God Bless each of you and your families.",
    "name": "Martin"
    },
    
    {
    "quote": "Thank you so much for continuing to look out for me.  The checks are very much appreciated.  You all jut bless me so much.  The money comes at the right times.  Sincere Thanks, Mary E. Martin",
    "name": "Mary"
    },
    {
    "quote": "Wallace & Graham, PA are mighty blessed to have Whitney Wallace Williams and Megan Hinson as part of your team.  Whitney and Megan are very professional, knowledgeable, and pleasant.  Throughout this long process both of these professionals have worked diligently to make sure I understood what was going on and how they were handling obstacles they were encountering. I appreciate Whitney and Megan and all the hard work they have done on my behalf.  The only negative aspect of working with Whitney and Megan…they make other attorneys and paralegals look bad because they are so good!",
    "name": "Melva Lilley"
    },
    {
    "quote": "When I was denied my disability, I immediately contacted Wallace & Graham to see if they would take my case. They helped me thru the disability process and they were very thorough in getting all the information together for my case. My lawyer, Whitney Wallace, was very good at helping me at my hearing. I got my disability within 2 years of resigning from my job due to my health with the aid of Wallace & Graham. I highly recommend their firm to anyone who needs help getting disability. ",
    "name": "Michael"
    },
    
    {
    "quote": " Wallace & Graham diligently fought for justice for our family while dealing with the insurance company and Angela and Megan, so kindly, attended to any questions we had during the workman’s compensation process. I highly recommend them to friends with legal situations. ",
    "name": "Mildred"
    },
    
    {
    "quote": "I learned about Wallace & Graham through a friend. I will highly recommend them for any asbestos related illness or injury that could be covered under workman’s compensation. They did an outstanding job for me. It may take a while for results, but it is worth the time. They worked very hard and kept me posted on the progress of my settlement. Many thanks to Ed & Trish for their hard work and support.",
    "name": "Monroe"
    },
    {
    "quote": "Tiffany Mack was up front from the beginning, honest and forthcoming about what to expect throughout the legal process. The only promise she made was that she would be there to guide us throughout it every step along the way. She was extremely patient and never unanswering! She was generous with her time and never made us feel like our questions were a bother. Tiffany’s professionalism, strength, and legal wit is unmatched! I recommend her to everyone I meet in need of legal services! I pray we should never need her service again, but look forward to always knowing I have a legal warrior in my corner. Thank you for fighting a battle we didn’t think we could win! We’re forever grateful! Mr. and Mrs. David Clark",
    "name": "Mr. & Mrs. Clark"
    },
    {
    "quote": "For three years I worked with my employer thinking that I could handle it myself. It came a time where they would no longer send me to the doctor. I contacted Wallace and Graham to help through this. I was helped every step of the way with professional courtesy and understanding. The whole team: Whitney Wallace, Megan Hinson, Daniel Wallace and the receptionist were all very kind. Anytime that I called or had a question they were there. I have never dealt with a lawyer, but I would highly recommend Wallace & Graham. My stress level and worries were relieved. I knew that they all had my best interest at heart. Thank you so very much! ",
    "name": "Nancy"
    },
    
    {
    "quote": "Dear Mrs. Wallace and Mr. Graham and to all personally involved, I can’t begin to thank you all for working so hard and putting in so many hours on the case for Thomas W. Currence and Norma.  All Thomas ever wanted to do was take care of his family, and which I hate he is not here to see this money, maybe this is his way of taking care of me. It means so much that you were willing to work so hard for a simple little family like ours. It amazes me also to think how many hours or years it would have taken him to make that amount of many. Again, thank all of you very much. Forever Grateful, Norma Currence",
    "name": "Norma Currence"
    },
    {
    "quote": "Thank you so very much! Each of you guys are amazing at what yall do! Thank you! ",
    "name": "Paul"
    },
    
    {
    "quote": "Bill, Mona Lisa, Cathy, Stephanie and all other associates of Wallace & Graham have always treated us with the utmost caring, concern and compassion – and with our best interest at heart. We have already recommended them to others with legal needs and will continue to do so in the future.",
    "name": "Paul"
    },
    
    {
    "quote": "I want to say thank you Wallace & Graham for all your hard work and commitment on my workers comp case. You are a team that wins! I couldn't have done it without all of your hard work, experience and capabilities. It's nice to know that when you really need help there are good and capable people there to help. I very much appreciate your honesty and integrity in handling a difficult situation. I would recommend Wallace & Graham to anyone with legal needs. Thank you again Wallace & Graham.",
    "name": "Percival"
    },
    
    {
    "quote": "I want to say you all did every thing just right. I could not ask for nothing to be done any better then you all did.",
    "name": "Robert"
    },
    {
    "quote": "I am well pleased with Wallace & Graham who handled my case. They were so devoted, took the time and effort to get me what I deserved. I highly recommend Wallace & Graham to anyone needing legal help. Wallace & Graham is a notch above all other law firms.",
    "name": "Robert"
    },
    {
    "quote": "I would recommend the firm of Wallace & Graham to anyone with any legal needs. They won a complicated workman’s compensation case for me. They always helped me understand each step of the process and regularly updated me on the progress of my case. I am completely satisfied with their help.",
    "name": "Robert"
    },
    {
    "quote": "Dear Mona Lisa, Thank you to everyone in your firm for all the help over the last couple years, including Lucinda, Daniel and Whitney and all the others behind the scenes that I have not met. You should be very proud of Whitney as she is smart, intelligent, and fiery like you!!  Great Representation!!",
    "name": "Robert & Kim Newton"
    },
    {
    "quote": "I am very satisfied with your law firm.  I found everyone helpful and willing to assist me in every way possible.  I would highly recommend you to anyone!",
    "name": "Robert Helton, Jr."
    },
    {
    "quote": "Thank you for your persistent effort Wallace and Graham.",
    "name": "Roland"
    },
    {
    "quote": "Since becoming a client of Wallace and Graham in 2019, it has been a positive experience.  Any time I needed answers to my questions concerning my case, Wallace and Graham was always available to help and were very professional.  My main contact with Wallace and Graham was Trish McDermott, who was very helpful and knowledgeable.  In the future I would not hesitate using Wallace and Graham or recommending your law firm to family and friends, which I have done several times already.",
    "name": "Ronald Beason"
    },
    
    {
    "quote": "To the Wallace & Graham law firm, we would like to say thank you for what you have done, Mr. Pross the work you have done we would like to say a Thank You! And if you can please stay in touch, Thank you all and May God truly bless you.",
    "name": "Ronnie"
    },
    
    {
    "quote": "To all of the staff at Wallace and Graham, Thank you for all the hard work you all have done over the years. This check came at a time when I really need it. Again I thank you. ",
    "name": "Ruby"
    },
    
    {
    "quote": "Thanks for your continued effort on my behalf!",
    "name": "Sevone"
    },
    
    {
    "quote": "Dad and I would like to express our thanks and appreciation for representing us in Mom’s workers’ compensation case.  Your courtesy, kindness and professionalism was always displayed to us in all interactions with your firm.  Amanda did a terrific job in keeping me informed and up to date through all emails and phone conversations.  Working with your firm throughout this whole process was a pleasure and without reservation would highly recommend Wallace and Graham to anyone needing legal services. Sincerely, Sherry Crooke, Daughter of Margie Ruth Cooper",
    "name": "Sherry Crooke"
    },
    {
    "quote": "Wallace & Graham have worked very hard for me on my hearing loss case. Mark and Frieda have done their homework and helped me win this case. It has not been easy or quick. Mark assured me that we had a good case, and that we would win. I am very satisfied with my attorney he dug deep and hit them hard – where it hurts. I know he had some trying times with Domtar’s lawyer and the industrial commission. I could not had made it without you. Thank you very much Mark and Frieda.",
    "name": "Thomas"
    },
    {
    "quote": "I was injured at work, a brain injury, and have never had to deal with a workers comp or personal injury case ever in my life, being the one hurt.  I had no idea what I needed to do to make sure my family, and myself were going to be taken care of medically and financially.  My wife and I made an appointment with Wallace and Graham to come in and discuss my injury and what our options were and to help understand what we needed to do to make sure we were protected.  On that very first visit we were greeted in the lobby by a lady, who I had no idea who she was, but later would have the greatest respect for.  That lady was Mona Lisa Wallace.  Mona asked me if we were taken care of and how we were doing, if we needed some water, and what the purpose of our visit was.  After we explained to her what had happened to me, Mona dropped everything and sat down with us.  Not only that, she began calling in other attorneys to get their opinions as well.  At first I was extremely overwhelmed by all the questions coming at me from every angle of the room, and when Mona asked everyone listened.  I later found out, this how Mona operates (full speed all the time).  Mona called her daughter in as well, at the time to over see the workers compensation side.  Whitney showed immediately, that the apple does not fall far from the tree.  Whitney assured me that she was going to oversee my case and that if I had any questions to giver her a call.  Both Mona and Whitney gave me not just the work phone numbers but their personal cell phone numbers and emails. (which they may have regretted later, I texted and emailed A LOT) Through out my injury and battles with Workers Comp, Whitney always had time for my calls, emails, texts, and was a shoulder for me to vent to or explain things to me that I would not understand. With a Brain injury you have mood swings and do some things that you really regret.  I once got so confused and frustrated that I sent an email that I terribly still regret to this day to Mona.  I questioned if they were working on my case and if they were questioning everyone.  Later, and as mentioned to this day I regret that email.  During the time of Wallace and Graham handling my case I really went though a lot of trials in my life.  I went through a divorce, PTSD, my mother passed away (and having lost my father 5 years before this really made me feel alone), depression, suicidal thoughts, started a new relationship, got married, bought a home, daughter issues…. Through out all of this Whitney was always there.  Whitney and Mona, and later Chuck were my only consistent in my life. Every meeting with Wallace and Graham I always left feeling like they cared and that I was their priority, ALWAYS. Mona and Whitney, I will never be able to thank you both enough for what you have helped me get through and made me believe in myself more and to understand that my injury wasn’t just a normal concussion. I could go on for days thinking of instances where they really comforted me along the way (like after reading a deposition). Thank you so much to the both of you and EVERYONE at Wallace and Graham. I know that if I still have any questions or if I needed them again for anything, they would be there for me once again.",
    "name": "Thomas Fiello"
    },
    {
    "quote": "Our family will always rest easy knowing the Wallace & Graham Legal Team are on our side!",
    "name": "Tim Hullett"
    },
    {
    "quote": "Hearing loss can affect you lively hood and we believe in finding a solution for our clients. Click here to view a testimonial from one of our clients.",
    "name": "Vega"
    },
    {
    "quote": "I would highly recommend Wallace & Graham’s law firm to anyone needing legal assistance. Everyone that I talked to were very understanding and very helpful in guiding me through the legal process with my worker’s compensation claim. I especially want to express a heartfelt thank you to Michael Pross for all of his hard work and his most needed guiding advice. In life everyone needs a guardian angel and mine within Wallace & Graham was Beth Ousley. She made sure all of my paperwork was in order and called me often to make sure I understood what to expect next and how to fill out the needed paperwork. “Hats off” to Wallace & Graham. May God Bless you Beth and Michael and of course Bill Graham.",
    "name": "William"
    },
    {
    "quote": " I know I am dying.  I  have been up since 3 am because I am so sick.  But I want you to know that Trish and everyone at Wallace & Graham have been excellent and you are amazing people.  I appreciate everything you have done. I can never thank you enough and for what little life I have left, I always be indebted to your firm.",
    "name": "William Smith"
    },
    {
    "quote": "Thank you all so much for all you do.  The endless hours and research that was put forth in the handling of my workers’ compensation claim and the communication was very constant.  I am impressed with the Wallace and Graham firm.  I would like to extend a special thank you to Amanda Norton.",
    "name": "William T. Poteat"
    },
    
    {
    "quote": "Wallace & Graham exemplify professionalism, integrity, compassion, and consistency. They took out the time to visit my dad, to explain the step by step process of his claim. My family and I, without reservations, highly recommend them for any legal matters. ",
    "name": "Wynima"
    }
    
    
    ]