[
    {
        "id":182,
        "title":"Tips for Law Firms Seeking Funds Under The Paycheck Protection Program",
        "content":"In response to the economic devastation created by the COVID-19 crisis, Congress created the Paycheck Protection Program ''PPP'' as part of the CARES Act. The PPP provides extremely low-cost loans, which will be forgiven if a qualifying applicant spends the proceeds on payroll and a few other items. In the few weeks since the CARES Act has passed, a number of law firms who appear to qualify for its relief are still waiting for a response to their applications. While firms should seek out advice from all appropriate professions as they pursue support under the PPP, we set out here to offer several points that we&apos;ve learned about the program.Tip One&colon; Be Careful Selecting Your BankUnder the terms of the CARES Act, any qualifying small business or qualifying non-profit should have been able to apply through its FDIC-insured bank and there is no requirement for collateral, a credit check or the traditional trappings of a business loan. But it&apos;s proving to be a little more complicated than that as banks set their own individual guidelines. Not all banks are proving equal in this crisis. Many larger banks have refused to accept applications from some businesses. This link on the SBA website provides a list of currently approved to file PPP loans&colon; https&colon; &#47;&#47;www.sba.gov&#47;paycheckprotection&#47;find.Experts also advise businesses to contact their local Small Business Development Center, Women&apos;s Business Center, or SCORE, which all include experts who provide free guidance via phone and email. You can also search for lenders at https&colon; &#47;&#47;smartasset.com&#47;insights&#47;ppp-loan-lenders and it identifies whether the lenders accept applications from non-customers.We have heard from a number of firms that have had better experiences with small lenders. They are far more likely to accept loan applications regardless of whether you have existing business with them. The smaller lenders not only submitted and gained approval from the SBA much more quickly, but have already delivered the proceeds of the loan in most cases. In many cases, it has been very hard for firms applying for PPP to reach a human being at larger banks.Tip Two&colon; Ask Whether Your Application Was Actually Submitted to the SBAIt is apparent that some lenders have accepted applications, but have not actually submitted them to the SBA for funding. We have learned of situations where applicants were given assurances both verbally and in writing that the application was ''complete'' or ''accepted,'' but later learned that the application had not been actually submitted to the SBA and accepted.We are aware of instances of this occurring even where the application was submitted on April 3rd, the first day that applications were accepted. More precise questioning can help to determine if you are caught in this trap. You can inquire directly to your lender whether the loan application has been actually submitted to the SBA and whether the SBA provided funding confirmation. The SBA provides an instantaneous response to properly submitted PPP applications in most cases and your lender should be able to provide that to you.This can be happening for a variety of reasons, some more nefarious than others. Part of the problem seems to be that there is relatively little economic incentive for a lender to submit a PPP loan. The lender receives only one percentage point on the loan and the good will value of customer service. At the innocent end of the continuum, some lenders have lacked enough portals to the submissions process, making it practically difficult for them to process loans in a timely manner.There are other lenders, though, who created their own issues by imposing lender specific requirements. According to one Maryland federal court interpreting the CARES act in a case against Bank of America, this is permissible. Still other lenders appear to have accepted applications but have no intention of submitting applications to the SBA for their own business reasons. They likely accepted the applications initially because the lender wanted to appear to be serving its business customers out of fear those business clients would migrate to another banking institution.Tip Three&colon; Explore Multiple PossibilitiesBecause this is a moving target, a few experts suggest filing applications with more than one lender, so that you have a better chance you have of seeing some movement with at least one of them. This is tricky, however, as you cannot actually end up submitting more than one actual application to the Small Business Administration.  With the worry about funding running out and some lenders changing priorities, it still makes sense to inquire with several lenders. This is simply a strategy to see who can fund you faster. Ask for institutions to contact you before submitting for approval, so you can make sure you do not accidentally apply for multiple loans, which would be fraud under the PPP Loans provisions.In addition to the list of lenders listed above on the SBA website, several Fintech companies like PayPal, Intuit and Square have all been approved to participate in the PPP program as well. It appears that their processing time is much faster because their business model and processes are built for speed.Tip Four&colon; Move Quickly!The reason for the urgency is that the $349 billion is clearly inadequate for the magnitude of need in the American small business community and is running out quickly. The Florida Banker&apos;s Association reported yesterday that they believe the existing funds would all be gone by today or tomorrow at the latest. Lawmakers are pushing for more funds but it hasn&apos;t happened yet.",
        "image":"https://wallacegraham.com/clientuploads/Blog_Images/Law_Firm_Paycheck_Protection.jpg",
        "tags": ["WordPress", "Themeforest", "Vie"],
        "date":{
          "day":"16",
          "month":"Apr"
        }
      },
      {
        "id":183,
        "title":"Lawsuit&colon; The Citadel and Nursing Home Neglect",
        "content":"April 21, 2020Salisbury, NCWALLACE & GRAHAM PRESS RELEASELAWSUIT BROUGHT AGAINST ACCORDIUS HEALTH BYRESIDENT OF THE CITADEL NURSING HOME IN SALISBURY NC FOR COVID-19-RELATED NEGLIGENCE AND INJURYOn Tuesday, April 21, 2020, Wallace & Graham, P.A. filed suit, which can be found here, on behalf of plaintiff Marjorie Fuller Garvin against defendants Accordius Health, LLC, Accordius Health at Salisbury, LLC d&#47;b&#47;a The Citadel Salisbury, The Portopiccolo Group, LLC, CEO Hyman Simcha and Administrator Sherri Stoltzfus.  Ms. Garvin is a resident of the Citadel nursing home in Salisbury. The complaint alleges that The Citadel and the other defendants acted negligently and recklessly in their handling of a recent COVID-19 outbreak at the Citadel.  Ms. Garvin has been stricken by the disease.Ms. Garvin entered the Citadel earlier this year.  Now, she is one of many residents and staff who suffer from severe, life-threatening cases of COVID-19. The Citadel is a hot spot of the virus, believed to have multiple deaths and in excess of 100 reported cases at the facility as of April 20, 2020.  The dire situation at the Citadel was recently exposed and detailed by reporting in the local news outlet, the Salisbury Post.The facility is part of a claim owned and controlled by a private equity investment firm in the New York area.  The family alleges that the company failed to track the virus as it grew and spread and did not take proper steps to protect Ms. Garvin and others from the pandemic.  Once it hit, family members were unable to reach staff by phone and were left in the dark on the status of their loved ones.  Citadel staff have complained that they, too, were not given proper protection and were left in the dark by the corporate office. Accordius Health owns and operates numerous nursing homes in and around the Charlotte, Triad and Asheville areas, and elsewhere in North Carolina. According to Mona Lisa Wallace&colon; ''Our firm is very concerned regarding the issues exposed by the facts that are known in this case.  The public records regarding this nursing home facility reflect that unsanitary and unsafe conditions existed even before the virus came to our area.  The residents of elder care facilities are some of our most vulnerable citizens.  They deserve much better.  Not only the residents, but their family members, friends, the staff, and physicians have all been exposed and put in jeopardy because of what has occurred.  We believe the company should have done much more to anticipate and guard against the COVID-19 virus before it was too late.''",
        "image":"https://wallacegraham.com/clientuploads/Blog_Images/Nursing_Home_Neglect.jpg",
        "tags": ["WordPress", "Themeforest", "Vie"],
        "date":{
          "day":"22",
          "month":"Apr"
        }
      },
      {
        "id":185,
        "title":"Rowan County Accordius Lawsuit To Seek Improvements In Corporate Support For Front-line Staff And Residents",
        "content":"ROWAN COUNTY ACCORDIUS LAWSUIT TO SEEK IMPROVEMENTS IN CORPORATE SUPPORT FOR FRONT-LINE STAFF AND RESIDENTS Wallace and Graham and Gugenheim Law team up to demand reform at The Citadel at Salisbury, a nursing home operated by Accordius Health April 28, 2020, Salisbury NC - Law firms in Salisbury and Raleigh have teamed up to file new claims, which can be viewed here, seeking to have a Judge review the practices at The Citadel Salisbury nursing home. Accordius Health, owned by the Portopiccolo private equity group in New Jersey, owns and operates a chain of 50-plus facilities. Acting on behalf of the caretakers of Marjorie Garvin, a resident at the Citadel, the Wallace and Graham law firm in Salisbury filed a claim on her behalf on April 21 in the Rowan County Superior Court. Sadly, we learned late yesterday that Margorie Garvin passed away. We are dismissing her complaint at this time to allow the family to grieve and to get her estate in order. Now, joining with Steve Gugenheim, of Gugenheim Law in Raleigh, a lawyer who has spent the last 20 years prosecuting claims of nursing home abuse and neglect, a new Complaint along with witness statements has been filed. The new claim focuses on seeking a comprehensive review of the facility&apos;s policies. It asks the Court to review the practices of the troubled care facility in order to prevent further neglect. The current claim seeks only injunctive relief, and not monetary damages, in order to force compliance with regulations and North Carolina law. Speaking for Wallace and Graham, Mona Lisa Wallace said&colon; ''We felt we had no choice but to file this suit in order to protect the health, safety and welfare of the elderly population and those dedicated to caring for them. The claim seeks to prevent the endangerment of the family members of residents and caregivers, our hospital workers, funeral directors and the community at large. We have received an overwhelming number of calls from families of residents, caregivers, employees and contractors. Their stories are heartbreaking. Our thoughts and prayers go out to them, and we will use our very best skills and talent to protect them and others in our community. We believe that the evidence confirms operational deficiencies on a massive scale, and we felt the most appropriate course of action was to seek Court intervention and request injunctive relief.'' Speaking for the Gugenheim firm, Steve Gugenheim stated&colon; ''Our primary focus at this time is to fight for the health and safety of The Citadel&apos;s residents and to ensure that The Citadel is operated in accordance with North Carolina law and follows the guidelines recommended by the CDC. We recognize and appreciate that the nurses and aides working in the trenches are doing the best they possibly can with the resources made available to them. Our goal is to ensure that the corporate owners of this for-profit nursing home provide The Citadel staff with appropriate personal protective equipment, ensure they are appropriately trained in COVID-19 pursuant to state and CDC guidelines, ensure there are sufficient staff in place to meet the care needs of the residents, ensure the facility maintains transparency and family members are timely and properly informed about the health condition of their loved ones, and ensure that The Citadel complies with all applicable laws, rules and regulations. We are concerned, based on sworn statements by multiple current and former employees, residents, and family members of residents, that the current management has not and is not taking appropriate measures to protect the health and safety of residents and staff. We believe that Court intervention is necessary to ensure that management is adequately meeting the health and safety needs of its residents and staff in accordance with North Carolina law, rules and regulations.''",
        "image":"https://wallacegraham.com/clientuploads/Blog_Images/purple_Ribbon.jpg",
        "tags": ["WordPress", "Themeforest", "Vie"],
        "date":{
          "day":"28",
          "month":"Apr"
        }
      },
      {
        "id":186,
        "title":"W&G Gives Exceeds $10,000 In Lunches For Front Line Staff",
        "content":"May 19, 2020PRESS RELEASEW&G GIVES EXCEEDS $10,000 IN LUNCHES FOR FRONT-LINE STAFF On April 24, 2020, Wallace & Graham, P.A. proudly launched its new charitable support effort, Wallace & Graham Gives, with an initial $10,000.00 donation to the Rowan County United Way COVID-19 Relief Fund. In addition, since that time, the program has funded approximately 900 staff lunches exceeding $10,000 to support Novant Health&apos;s Respiratory Screening Center RAC located in Novant Health Medical Park, off of Jake Alexander Boulevard across from West End Plaza. W&G Partner Bill Graham, the current Chair of the Novant Health Foundation, spearheaded the donation.  ''It was important to us to support the dedicated front-line nurses and staff who are putting their lives on the line, working hard and stressful hours to support the continued health of this community.  We also wanted to support local restaurants given the toll that COVID-19 has taken on the restaurant industry.''  W&G has launched a W&G Gives Committee consisting of 12 W&G employees with board terms beginning June 1, 2020 which will assist in determining the recipients of additional grants in the future.  The program&apos;s primary mission will focus on initiatives that benefit the local community and the firm&apos;s past or present clients, as well as team-building charitable activities that the firm can take part in together.  ",
        "image":"https://wallacegraham.com/clientuploads/Blog_Images/Wallace&GrahamGives-ColorOption2.svg",
        "tags": ["WordPress", "Themeforest", "Vie"],
        "date":{
          "day":"19",
          "month":"May"
        }
      },
    {
      "id":10,
      "title":"Magazine Subscription Overbilling",
      "content":"We are investigating magazines that over-subscribe customers, double-bill for the same subscription, or employ other dishonest practices with customers.  Some magazines will send you a renewal notice before it is time to renew, which can fool you into renewing or buying a new subscription while the old one is still running.  The customer may end up with multiple subscriptions to the same magazine. If you believe you have been a victim of dishonest magazine billing practices, call for a free consultation&colon; 1-800-849-5291. We believe that several popular magazines may be employing this dishonest practice, and we would like to hear from you if you have experienced this. Please let us know if you have subscribed to a magazine and something like this happened to you.  Contact us if you believe that you have been overbilled for your subscription or the magazine tried to open multiple subscriptions under your name.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"09",
        "month":"Dec"
      }
    },
    {
      "id":9,
      "title":"NC Sexual Abuse Injury Attorney",
      "content":"Stories about childhood sexual abuse have been gaining more and more attention over the past several years.   These cases usually involve a violation of trust, from someone in a position power.  The perpetrator often has access to young people and uses this to establish a relationship with the victim.  The abuser may be a clergy member, teacher, friend, coach or even a family member.  Regardless of who the assailant is, the damage to the child is the same. If you or a loved one are dealing with the consequences of a sexual abuse, you may be able to file a civil lawsuit for damages in addition to the criminal charges.  Speaking to a qualified, experienced personal injury attorney at Wallace & Graham P.A. can help you understand your options so that you and your family can begin to move forward.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"02",
        "month":"Jan"
      }
    },
    {
      "id":11,
      "title":"Health Risks Associated with Medical Products",
      "content":"The FDA has recently announced the following health risks associated with medical products&colon;Alaris Pump Module Model 8100, Version 9.1.18 Software by CareFusion 303, Inc&colon; Class I Recall - May Not Properly Delay an Infusion.  Infusion start times earlier or later than intended could result in serious injury or death.Maquet Datascope Intra-Aortic Balloon Pumps&colon; Class I Recall - Failure of Fan Assembly.  Failure may cause pump to shut down without alarm, and result in heart failure, decreased blood flow to the heart, and&#47;or decreased blood flow to the body and brain.Baxter ABACUS TPN Calculation Software&colon; Class I Recall - Software Errors May Cause Toxic&#47;Overdose Symptoms.  ABACUS Total Parenteral Nutrition TPN Calculation Software is a computer program used by pharmacists to calculate or order TPN formulas, which are used to meet the nutritional needs of patients who cannot eat or drink by mouth.Fisher and Paykel Healthcare, Ltd., Infant Nasal CPAP Prongs&colon; Class I Recall - Prongs May Detach from Nasal Tubing and Interrupt Therapy.NaturaLyte Liquid Bicarbonate Concentrate&colon; Recall - potential health risk due to bacteria levels in affected lots.Male Sexual Enhancement Products&colon; Immediate Public Notification&colon; Undeclared Drug Ingredients.  Risk of interaction with nitrates found in some prescription drugs, such as nitroglycerin, and may lower blood pressure to dangerous levels.If you or someone you love suffers a serious injury from any defective product, whether it&apos;s on this list or not, remember to call Wallace & Graham at 704-633-5244 or 800-849-5291 for a free consultation.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"06",
        "month":"Jun"
      }
    },
    {
      "id":14,
      "title":"Catawba honors Bill and Shari Graham",
      "content":"Salisbury couple William ''Bill'' and Shari Marshall Graham were honored by their alma mater Sunday as recipients of Catawba College&apos;s Adrian L. Shuford Jr. Award for Distinguished Service.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"07",
        "month":"Jun"
      }
    },
    {
      "id":12,
      "title":"Potentially Dangerous Food and Drug Products",
      "content":"The following recalls of potentially dangerous food and drug products were announced by FDA&colon;Alexion Pharmaceuticals, Inc. initiated a voluntary recall of certain lots of Soliris® eculizumab 300 mg&#47;30 mL concentrated solution for intravenous infusion.  These lots were manufactured in such a way as to create a particulate in the solution which, if administered, could cause immune reactions and blood clots.Rite Aid voluntarily recalled some ''Thrifty'' brand Mint n&apos; Chip Ice Cream&colon; A batch of pistachio ice cream was mislabeled as Mint n&apos; Chip.  People who are allergic to nuts may have run the risk of life-threatening allergic reaction.PGG&#47;HSC Feed Company, LLC implemented a voluntary recall of 50-pound packages of its Champion Lamb Texturized B30 product due to higher than allowable copper levels. The product was manufactured in February 2014 and carries the UPC code UPC-748252483805 located in the bottom left corner of a white label attached to a Payback bag with a photo of a lamb.Ocean Spray voluntarily recalled two production lots of Ocean Spray® Greek Yogurt Covered Craisins® Dried Cranberries because consumers reported that some bags contained yogurt-covered peanuts. People who have an allergy or severe sensitivity to peanuts run the risk of serious or life-threatening allergic reaction if they consume peanuts.Health Matters America Inc. of Cheektowaga, New York voluntarily recalled Organic Traditions Sprouted Chia Seed Powder and Sprouted Chia&#47;Flax Seed Powder due to possible Salmonella contamination.Glutino, a division of GFA Brands, Inc. based in Paramus, NJ, voluntarily recalled Glutino Rosemary and Olive Oil Snack Crackers.  The recall was initiated because the seasoning supplier, Kerry Ingredients, recalled the seasoning blend due to possible Salmonella contamination.Baptista&apos;s Bakery, Inc. is voluntarily recalling 4,339 cases of LiveGfree Gluten Free Rosemary and Olive Oil Multiseed Crackers with a best if used by date of 11-24-14.  The recall was initiated because the seasoning supplier, Kerry Ingredients, recalled the seasoning blend due to possible Salmonella contamination.Hill&apos;s Pet Nutrition, Inc. of Topeka, KS voluntarily recalled 62 bags of Science Diet® Adult Small & Toy Breed™ dry dog food as they have the potential to be contaminated with Salmonella. The suspect product, part of a single production run, was distributed to 17 veterinary clinic and pet store customers in California, Hawaii and Nevada between April 24 and May 13, 2014.Princess House, a nationwide direct sales distributor of tableware and house goods announced that a small quantity of its Marissa Tangerine Appetizer Plates, when put into certain food service use, may allow cadmium and lead in the decorative plate decal to escape at levels exceeding U.S. Food and Drug Administration ''FDA'' and&#47;or California Proposition 65 guidance levels.  Princess House is voluntarily recalling all these Plates distributed through its consultant and hostess network.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"09",
        "month":"Jun"
      }
    },
    {
      "id":13,
      "title":"Mrs. Wallace Receives Prestigious Award",
      "content":"The N.C. Justice Center has honored attorney Mona Lisa Wallace with the prestigious Defenders of Justice Award for her work spanning more than three decades fighting for NC workers. For more than 30 years, Mona's work has focused on worker and consumer rights issues, addressing consumer protection and fraudulent sales practices and loans. Mona Lisa Wallace represents North Carolinians who have been victim to unsafe workplace conditions, consumer right violations, and predatory lenders who trap low and middle class families in unscrupulous loans. Fighting for working people became the theme of her career. Her primary accomplishment has been in the representation of employees, retirees, and their family members who suffer from work-related accidents, cancers, and other diseases. Mona Lisa is currently embroiled in significant environmental litigation in eastern North Carolina, in cases primarily involving minority communities exposed to terrible living conditions due to nearby industrialized hog farms.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"12",
        "month":"Jun"
      }
    },
    {
      "id":15,
      "title":"Avoid Mistakes when Applying for Social Security Disability",
      "content":"Each month, thousands of North Carolinians become disabled from working and apply for Social Security Disability SSD or Supplemental Security income SSI benefits. Unfortunately, many of those applying for benefits do so without the assistance of an attorney to help them avoid mistakes. The Social Security Disability Insurance program is funded by working people like you who pay Social Security taxes with every paycheck.  This program can provide you with financial support if you become unable to earn an income prior to retirement age.  The application and appeal process can be quite lengthy and frustrating.  An attorney experienced in handling disability claims can make the process easier and less stressful, and will represent you before an Administrative Law Judge if a hearing is necessary. If you have become disabled and would like to apply for Social Security Disability or would like help appealing your claim which has already been denied, call our office at 1-800-849-5291 for a free consultation.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"14",
        "month":"Jun"
      }
    },
    {
      "id":16,
      "title":"I applied for Social Security Disability and was denied. What do I do now?",
      "content":"It is very common for claims to be dismissed at the initial review.  This is why it is important for an attorney experienced in handling Social Security Disability claims to help guide you through the process, which often results in an in-person hearing before an Administrative Law Judge of the Social Security Administration.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"16",
        "month":"Jun"
      }
    },
    {
      "id":17,
      "title":"How much will it cost to retain Wallace & Graham to represent me?",
      "content":"It will cost you nothing to retain Wallace & Graham as your Social Security Disability attorney.  We get NO FEE unless you win.  If you are awarded benefits, our only fee is a percentage as determined by the Social Security Administration of the ''back pay'' you are awarded and is paid directly to us by Social Security.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"17",
        "month":"Jun"
      }
    },
    {
      "id":18,
      "title":"How do I qualify for Social Security Disability?",
      "content":"You must have some physical or mental conditions which has kept you or will keep you from obtaining gainful employment for a period of at least 12 months.  What constitutes gainful employment depends on your age and other factors.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"18",
        "month":"Jun"
      }
    },
    {
      "id":19,
      "title":"Auto Accident Check List",
      "content":"Before getting in an accident, make sure you have proper insurance.Check to see if anyone is injured.  But remember that car accidents can cause injuries that only surface later.Exchange information with other drivers.Get witnesses&apos; names, addresses, phone numbers, and e-mail addresses.Take pictures — not just the vehicles, but anything that you feel is relevant to the accident.Draw a sketch of how the accident occurred.Only discuss the accident with the police and emergency personnel.Immediately contact the experienced auto accident attorneys at Wallace & Graham 704- 633-5244.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"20",
        "month":"Jun"
      }
    },
    {
      "id":24,
      "title":"Ammonia Spill at Smithfield Plant in Tar Heel",
      "content":"On Tuesday June 17, 2014, there was a large ammonia spill at the Smithfield plant in Tar Heel, Bladen County.  The leak forced more than 2,000 workers to leave the slaughterhouse and some have reported injuries. Ammonia is a dangerous and poisonous substance that can come in gas or liquid form.  It is a danger at processing plants and can also come off the lagoons and hog farms in affected neighborhoods. Symptoms of ammonia poisoning can include coughing, chest pain and difficulty breathing, red and burning eyes, throat and mouth pain, stomach pain and vomiting among other symptoms. The Smithfield Packing plant in Tar Heel has been described as the largest pork processing plant in the world.  According to news reports, in the recent incident a tank burst spilling thousands of gallons.  Injured workers were taken to Cape Fear Valley Medical Center in Fayetteville. According to reports, the plant had a prior ammonia leak in 2012.  Several workers were hospitalized and government regulators fined the company. Wallace & Graham is representing nearby neighbors of industrialized swine confinement facilities in North Carolina for claims of nuisance and injury.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"21",
        "month":"Jun"
      }
    },
    {
      "id":20,
      "title":"Nursing Home Abuse and Neglect&colon; Signs to Look Out For",
      "content":"Nursing homes are supposed to be comfortable, quiet places where elderly loved ones can affordably receive around-the-clock care and attention.  Sadly, too often negligent hiring practices or other issues create a situation where loved ones are ignored or abused. Nursing home neglect is a situation where the nursing home fails to meet its obligation to care for a patient, for example failing to administer needed medications.  It can be intentional or unintentional.Nursing home abuse is intentional and can include&colon;Physical Abuse Unexplained injuries, bruises, broken bones, broken eyeglasses, signs of being restrained such as rope marks. Can include unnecessary medical procedures performed in order to claim reimbursement from insurance or Medicare.Emotional AbuseMore difficult to spot than physical abuse; signs include negative behavior by caregiver toward the patient in your presence, and withdrawn behaviors on the part of the patient.Financial AbuseCan include forging patient&apos;s signature, phony charities, phony raffles.  Look for suspicious financial activity, missed bill payments, sudden changes in financial condition.Sexual AbuseSigns include bleeding or bruising around sex organs, unexplained sexual disease, torn or stained underclothing. If you believe that a loved one has suï¬€ered nursing home abuse or neglect, call the experienced attorneys of Wallace & Graham at 800-849-5291.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"22",
        "month":"Jun"
      }
    },
    {
      "id":21,
      "title":"Social Security Disability Checklist",
      "content":"Prior applications if you have ever applied;All medical records documenting your conditions;Written statement from your doctors that you are disabled;List of all medications and each dosage;List of all jobs you have held the past 15 year Social Security number of spouse and your dependents, if any;If not a US citizen, a valid birth certificate and passport;Social Security benefits statement, which can be found here Please contact one of our attorneys for a free consultation.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"24",
        "month":"Jun"
      }
    },
    {
      "id":25,
      "title":"Mona Lisa and Lee Wallace Care About Education",
      "content":"Mona Lisa Wallace, partner of Wallace & Graham, said the site was ideal for the central office because it was ''supported by the city and the county.''''We care about education in Rowan County,'' she said, adding that as a graduate of North Rowan High School, she&apos;s a product of the county school system.To read more, please click here.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"27",
        "month":"Jun"
      }
    },
    {
      "id":22,
      "title":"New Research Concludes Diesel Exhaust Exposures cause&apos;s Cancer in Workers including at Risk Occupations such as Railroad Workers, Miners, Truck Drivers and Industrial Workers regularly Exposed to Diesel Exhaust.",
      "content":"Diesel engine exhaust has now been definitively linked to causing cancer in humans. A panel of experts working for the World Health Organization WHO concluded in June 2012 that diesel exhausts is a potential cause of lung cancer. Diesel exhaust has also been linked to pancreatic and bladder cancer. After a week-long meeting of international experts, the International Agency for Research on Cancer IARC, a part of the World Health Organization WHO, classified diesel engine exhaust as carcinogenic to humans Group 1, based on sufficient evidence that exposure is associated with an increased risk for lung cancer. WHO based its findings on research in high-risk workers including railway workers and others industrial workers exposed to diesel exhaust. Similarly, American scientists have also found an increased risk of developing lung cancer in workers exposed to diesel fuel exhaust. A recent study found evidence that diesel exhaust exposure supports it as a cause of lung cancer in industrial workers and represent a potential public health burden. See The Diesel Exhaust in Miners study by Debra T. Silverman, et al., JNCI, Journal of the National Cancer Institute, Vol. 104, Issue 11, June 6, 2012. This is very disturbing for the industrial worker as most industries operate a significant amount of diesel powered equipment without providing adequate safety measures for those exposed. Diesel exhaust exposure places the worker at risk for cancer. This risk has been studied and known for years yet many industries have simply ignored the risk and not instituted safety measure or discontinued use of diesel equipment in favor of equipment with safe levels of emission.For decades, industry has relied upon diesel engines as a ''cheaper'' alternative to gasoline powered vehicles and ports, railroad yards and powerhouse industries have widely used heavily polluting diesel engines in its trucks, cranes, ships, trains and other equipment. In the process, industry needlessly over-exposed countless workers, drivers, mechanics, conductors, engineers and others to cancer causing pollution in doses sufficient to cause cancer and in doses that are much greater than the public exposure. All workers with a history of such diesel exhaust exposures who have contracted cancer should look closely at their potential rights.If you have been exposed to diesel exhaust at your current or previous industrial job and have developed lung, pancreatic or bladder cancer you may be entitled to compensation. Even if you were or are a smoker, your lung, pancreatic and&#47;or bladder cancer may still be related to your exposure to diesel fuel exhaust. Please call us for a confidential no obligation and no cost initial consultation to determine you or your family member&apos;s rights.",
      "image":"",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"30",
        "month":"Jun"
      }
    },
    {
      "id":178,
      "title":"Wallace & Graham's Environmental Litigation",
      "content":"Wallace & Graham&apos;s Environmental LitigationYou may be aware of how the environment is being affected by climate change, fossil fuels, deforestation, or other environmental concerns. The right to a healthy environment and clean water is one of our most essential rights.  A healthy environment promotes our natural way of life and survival. In fact, most of everything surrounding us is an extension of the environment&colon;We use printed paper for our 9 to 5 jobs that comes from treesWe use water that comes from water systems connected to streams, rivers, and lakes to wash our hands and cook our food.We eat food grown in soil that contains nutrients that assist in food growth.The environment contributes to our daily lives in multiple ways and it is necessary and critical for us all to maintain and protect it. Wallace & Graham has worked hard to ensure that corporate actors are fulfilling that obligation and duty to our environment.One of the most notable cases Wallace & Graham has tackled recently has been coal ash contamination. Duke Energy has been burning coal since 1911 in the Carolinas, and their first coal-fired plants were developed in Greensboro N.C., and Greenville, S.C. One of the biggest challenges is how to burn coal cleanly and sustainably. Coal Ash contains toxins that can harshly affect individuals and the environment such as&colon;ChromiumArsenicLeadSelenium Coal Ash toxins can dissipate through the topsoil and have the potential to pollute waterways, groundwater, and the air. Those toxins can move through the environment by runoff and erosion. In turn, that runoff and erosion can contaminate streams and rivers that can harm wildlife. When the Dan River spill occurred, the residents&apos; quality of water was called into question. After the spill, the Coal Ash Management Act was passed by the state legislature in 2014.In 2016, the Coal Ash Management Act was amended, and HB630 stated Duke must provide connections to public water supplies and filter systems. Several residents of neighborhoods near Duke coal plants began and continue to speak out against the effects of Coal Ash. Wallace & Graham filed a lawsuit in Raleigh on behalf of residents that lived within one-half mile of coal ash ponds at Duke&apos;s plants. The ponds were unlined, and litigants alleged that contaminants may have leaked and harmed their environment and property.Our firm has worked to investigate and minimize negative environmental impacts that have affected over 400 neighbors of coal ash ponds in Brown, et. al. v. Duke Energy. The Duke Energy coal ash litigation is an example of just one matter that Wallace & Graham has pursued to promote a healthy environment.Today challenges with the environment continue to press on as it becomes imperative for us to contribute, protect, sustain, and resolve issues. Wallace and Graham&apos;s law firm is proud to be a part of litigation aimed to protect and&#47;or restore the environment. If you have any concerns regarding nearby hazardous operations or conditions near might affect you, family, or environment please call Wallace& Graham P.A. at 704 633-5244.",
      "image":"https://wallacegraham.com/clientuploads/Blog_Images/Dan_River_coal_ash_spill_-_impoundment_and_power_plant_-_2014.jpg",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"25",
        "month":"Feb"
      }
    },
    {
      "id":179,
      "title":"Hidden Danger of Trampoline Parks",
      "content":"Indoor trampoline parks are a new trend that is exploding in popularity, but these parks can actually be very dangerous.  Experts have spoken out against trampoline parks on various issues that create hazards to consumers, from the lack of supervision to the position of trampolines flush against thinly-padded walls.CBS News stated that in the past seven years at least six 6 people have died at trampoline parks. The Consumer Product Safety Commission stated that almost 18,000 individuals ended up in emergency rooms in 2017 alone.  Injuries that can come from these parks can be life-threatening including fractured necks, fractured backs, and dislocated and open-fracture elbows. The problem lies in the design. Several trampolines are connected to steel chains or links under very thin padding. As people jump, they create waves of energy and as they move with that energy, when they make contact or receive contact from someone twice their weight, they can end up with crushed bones. Allowing adults and children to jump and do flips at the same time creates a risk of collision that can lead to injury or death.  Many injuries from these parks happen to adults, but children have also been a victim to trampoline park injuries. Injuries can also result from employee negligence including lack of supervision, poor training, lack of security, and faulty equipment.Despite recurrent injuries and deaths, trampoline parks operate with no federal oversight, and in most cases, you will have obstacles seeking compensation if you are injured. Upon coming to one of these parks, you are required to sign a waiver.  These companies have deliberately made it more difficult to hold them accountable for damages caused by their parks.  Families come to these parks expecting it to be safe, not knowing that it is not safe at all. Families are putting their trust in these companies and signing a waiver not knowing the dangers that arise. Our firm is actively working to investigate these companies and the harm that is caused by these parks.  We have experience in handling these claims and know the unexpected and serious harms that befall upon unsuspecting families.If you or a loved one have been injured after visiting a trampoline park, please feel free to give our office a call at 800.849.5291 for a free consultation or email us at cs@wallacegraham.com.  ",
      "image":"https://wallacegraham.com/clientuploads/Blog_Images/Trampoline_Park_Image.jpg",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"09",
        "month":"Mar"
      }
    },
    {
      "id":180,
      "title":"A Person to Honor",
      "content":"On February 20, 2020 in New Orleans, Louisiana, Mona Lisa Wallace received the Tommy Malone American Eagle Award from the Southern Trial Lawyers Association.  The honor is only awarded for those whose calling is to help others. The recipient must be an embodying symbol of integrity, bravery, freedom, pride, and strength. Mona Lisa Wallace has demonstrated these characteristics throughout her career and continues to do so. Attorney Charles G. Monett III introduced and recognized Wallace for her resilient work and representation of justice.  He acknowledged her unwavering fight for justice for those preyed upon by the Payday Lending industry. He recognized her for protecting car purchasers from unethical and immoral car dealers, who took advantage and forced them to buy things they didn&apos;t want.  He recognized her for helping retirees of steel industries to receive or keep their medical benefits. When the audience thought he was done, he celebrated Wallace for her long fight against the hog industry where clients were subjected to industrialized hog farming with effects reaching their backyards. The audience applauded in respect and awe over Mona Wallace&apos;s massive effect on the lives of others, and in pursuit of the justice system. Wallace was not only a recipient of the American Eagle Award, but she is also the first female since 2006 to receive the award after fourteen male recipients. When Wallace stepped on the stage, she graciously accepted her award.  She told the audience about her appreciation for North Carolina and how humbled she was to serve the people. She remembered the first time she met Tommy Malone, the first-ever recipient of the American Eagle Award, and recalled him as kind and giving. She recounted his work in the civil rights movement, and his plight to do what was right. The night was filled with joy and delight over Wallace&apos;s award. From a humble upbringing in Salisbury and Spencer to founder and co-partner of a firm that represents tens of thousands of clients, to an award-winning lawyer and former president of Public Justice, to a mother, grandmother, and community leader, Mona Lisa Wallace has managed to set the bar high for upcoming lawyers and attorneys. ''Receiving the Tommy Malone American Eagle Award was such an honor,'' Mona Lisa Wallace says, ''but my staff has also helped in this long journey of what is right for our clients.''  At Wallace & Graham, we are committed to our clients and their well-being. If you have questions about or need help with employment benefits, personal injury or death, work-related injuries, social security disability, or environmental litigation, please do not hesitate to contact us.",
      "image":"clientuploads&#47;News&#47;A_Person_To_Honor.JPG",
      "tags": ["WordPress", "Themeforest", "Vie"],
      "date":{
        "day":"16",
        "month":"Mar"
      }
    }
  ]